[{"name":"ГЛАВА VI. УПРАВЛЕНИЕ ТРАНСПОРТНЫМ СРЕДСТВОМ В НЕТРЕЗВОМ ВИДЕ","item":[{"amount":"300000","reason":"25.6 АК","text":"Статья 25. За управление транспортным средством в состоянии алкогольного опьянения предусматривается штраф в размере $300,000. Для малоимущих "},{"amount":"300000","reason":"26.6 АК","text":"Статья 26. За управление транспортным средством под воздействием наркотических, психотропных или токсических веществ предусматривается ш"}]},{"name":"ГЛАВА VII. ИСПОЛЬЗОВАНИЕ МОБИЛЬНЫХ ТЕЛЕФОНОВ ЗА РУЛЕМ","item":{}},{"name":"ГЛАВА VIII. ЕЗДА НА ТРАНСПОРТНОМ СРЕДСТВЕ","item":[{"amount":"150000","reason":"28.8 АК","text":"Статья 28. За использование неисправного транспортного средства предусматривается штраф в размере $150,000. Для малоимущих лиц предусмотрено "},{"amount":"150000","reason":"29.8 АК","text":"Статья 29. За вождение без регистрационных номеров предусматривается штраф в размере $150,000. Для малоимущих лиц предусмотрено уменьшение штр"},{"amount":"150000","reason":"30.8 АК","text":"Статья 30. За движение транспортного средства по полосе встречного движения предусматривается штраф в размере $150,000. Для малоимущих лиц пре"}]},{"name":"ГЛАВА IX. ПАРКОВКА И ДВИЖЕНИЕ ТРАНСПОРТНОГО СРЕДСТВА В НЕПОЛОЖЕННОМ МЕСТЕ","item":[{"amount":"120000","text":"Статья 31. За парковку в неположенном месте предусматривается штраф в размере $120,000. Для малоимущих лиц предусмотрено уменьшение штрафа на 90","reason":"31.9 АК"},{"amount":"120000","text":"Статья 32. За движение по тротуарам, велосипедным и пешеходным дорожкам предусматривается штраф в размере $120,000. Для малоимущих лиц предусмо","reason":"32.9 АК"},{"amount":"120000","text":"Статья 33. За движение по обочине нарушитель предусматривается штраф в размере $120,000. Для малоимущих лиц предусмотрено уменьшение штрафа на ","reason":"33.9 АК"},{"amount":"120000","text":"Статья 34. За брошенный транспорт на дороге, сотрудник правоохранительных органов штата Туксон имеет право эвакуировать транспорт и выписа","reason":"34.9 АК"},{"amount":"120000","text":"Статья 35. За движение по газонам или песку нарушитель предусматривается штраф в размере $120,000. Для малоимущих лиц предусмотрено уменьшение ","reason":"35.9 АК"},{"amount":"120000","text":"Статья 36. За езду по железнодорожным путям нарушитель предусматривается штраф в размере $120,000. Для малоимущих лиц предусмотрено уменьшение","reason":"36.9 АК"}]},{"name":"ГЛАВА X. ЗАТРУДНЕНИЕ ДВИЖЕНИЯ","item":[{"amount":"120000","text":"Статья 37. За затруднение движения на проезжих частях предусматривается штраф в размере $120,000. Для малоимущих лиц предусмотрено уменьшение ","reason":"37.10 АК"},{"amount":"300000","text":"Статья 38. За затруднение движения на проезжих частях, вследствие чего произошло дорожно-транспортное происшествие предусматривается штра","reason":"38.10 АК"}]},{"name":"ГЛАВА XI. ДОРОЖНО-ТРАНСПОРТНОЕ ПРОИСШЕСТВИЕ","item":[{"amount":"150000","text":"Статья 40. При наличии пострадавших в результате дорожно-транспортного происшествия, виновник подвергается УК","reason":"40.11 АК"},{"amount":"375000","text":"Статья 42. За покидание места дорожно-транспортного происшествия или попытку покинуть его предусматривается штраф в размере $375,000. Для мало","reason":"42.11 АК"}]},{"name":"ГЛАВА XII. ПЕШЕХОДЫ","item":[{"amount":"37500","text":"Статья 43. За переход дороги в неположенном месте, либо же за передвижение пешехода по проезжей части дороги пешеходом предусматривается шт","reason":"43.12 АК"},{"amount":"75000","text":"Статья 44. За создание аварийной ситуации пешеходом предусматривается штраф в размере $75,000. Для малоимущих лиц предусмотрено уменьшение шт","reason":"44.12 АК"}]},{"name":"ГЛАВА XIII. ИСПОЛЬЗОВАНИЕ ГОРОДСКОГО ТРАНСПОРТА В ЛИЧНЫХ ЦЕЛЯХ","item":[{"amount":"30000","text":"Статья 45. За использование городского транспорта в личных целях предусматривается штраф в размере $300,000. Для малоимущих лиц предусмотрено ","reason":"45.13 АК"}]},{"name":"ГЛАВА XIV. НАРУШЕНИЕ ОБЩЕСТВЕННОГО ПОРЯДКА","item":[{"amount":"75000","text":"Статья 46. За распитие алкогольных напитков в общественных местах предусматривается штраф в размере 75,000$. Для малоимущих лиц предусмотрено ","reason":"46.14 АК"},{"amount":"200000","text":"Статья 47. За неадекватное поведение в публичных местах, такое как публичное раздевание, залезание на остановки и другие подобные действия, ","reason":"47.14 АК"},{"amount":"75000","text":"Статья 48. За беспричинное использование огнетушителей, баллончиков с краской и прочих пачкающих веществ вблизи людей и муниципальных объе","reason":"48.14 АК"},{"amount":"37500","text":"Статья 49. Публичное громкое прослушивание музыки, если имеются жалобы со стороны других лиц предусматривается в размере $37,500. Для малоимущ","reason":"49.14 АК"},{"amount":"75000","text":"Статья 50. За использование нецензурной лексики в общественных местах предусматривается штраф в размере $75,000. Для малоимущих лиц предусмот","reason":"50.14 АК"},{"amount":"75000","text":"Статья 51. За ношение маски в общественных местах предусматривается штраф в размере от $50,000 до $75,000. Для малоимущих лиц предусмотрено уменьш","reason":"51.14 АК"},{"amount":"300000","text":"Статья 52. За участие в уличных гонках или организацию таких гонок предусматривается штраф в размере $300,000. Для малоимущих лиц предусмотрено","reason":"52.14 АК"},{"amount":"200000","text":"Статья 53. За установку ларька на тротуаре у центрального рынка города Лос-Сантос, которые могут затруднять проезд служебных автомобилей ме","reason":"53.14 АК"},{"amount":"300000","text":"Статья 54. За действия или(и) слова, оскорбляющие честь и достоинство гражданина, предусматривается штраф в размере от $200,000 до $300,000. Для мало","reason":"54.14 АК"}]},{"name":"ГЛАВА XV. ПОРЧА ИМУЩЕСТВА","item":[{"amount":"200000","text":"Статья 55. За нанесение ущерба имуществу граждан штата Туксон, государственных организаций и частных лиц предусматривается штраф в размере","reason":"55.15 АК"},{"amount":"200000","text":"Статья 56. За вандализм и уничтожение муниципальной инфраструктуры, такой как столбы, скамейки, остановки и прочие объекты предусматривает","reason":"56.15 АК"}]}]