[{"name":"Статья 7. Оскорбления.","item":[{"lvl":"1","reason":"7.1 УК","text":"1. Оскорбительные высказывания любого характера в отношении другого лица с целью унижения его достоинства, личности."},{"lvl":"2","reason":"7.2 УК","text":"2. Оскорбительные высказывания любого характера в сторону государственного служащего, исполняющего в тот момент обязанности."},{"lvl":"1","reason":"7.3 УК","text":"3. Дискриминация по расовому или гендерному признаку в отношении другого лица."},{"lvl":"2","reason":"7.4 УК","text":"4. Угроза словесного характера, предполагающая убийство, физическую расправу в отношении другого лица."},{"lvl":"2","reason":"7.5 УК","text":"5. Провокация сотрудника правоохранительных органов на совершение преступления, правонарушения иного вида."},{"lvl":"2","reason":"7.6 УК","text":"6. Умышленное распространение заведомо недостоверных сведений, порочащих честь и достоинство другого лица."}]},{"name":"Статья 8. Нарушение общественного порядка.","item":[{"lvl":"2","reason":"8.1 УК","text":"1. Нарушение общественного порядка по мотивам явного неуважения к обществу, сопровождающееся особой дерзостью."},{"lvl":"2","reason":"8.2 УК","text":"2. Непристойное поведение в общественных местах, демонстрация детородных органов."},{"lvl":"2","reason":"8.3 УК","text":"3. Намеренное сокрытие личности в общественных местах."}]},{"name":"Статья 9. Умышленное причинение вреда.","item":[{"lvl":"3","reason":"9.1 УК","text":"1. Намеренное нападение на человека с целью нанесения лёгких или средних телесных повреждений."},{"lvl":"4","reason":"9.2 УК","text":"2. Нанесение тяжких телесных повреждений без использования холодного или огнестрельного, травматического, пневматического оружия."},{"lvl":"4","reason":"9.3 УК","text":"3. Намеренное нападение с использованием холодного или огнестрельного оружия."}]},{"name":"Статья 10. Порча имущества.","item":[{"lvl":"4","reason":"10.2 УК","text":"2. Уничтожение частного, государственного движимого или недвижимого имущества."}]},{"name":"Статья 11. Ограбление.","item":[{"lvl":"2","reason":"11.1 УК","text":"1. Вымогательство, кража материальных ценностей у лица без выраженной угрозы жизни."},{"lvl":"5","reason":"11.2 УК","text":"2. Разбой, ограбление лица с угрозой жизни или применением физической силы."},{"lvl":"3","reason":"11.3 УК","text":"3. Проникновение на территорию движимого и недвижимого имущества с целью совершения ограбления."},{"lvl":"4","reason":"11.4 УК","text":"4. Завладение или попытка завладения чужим имуществом без разрешения его владельца."},{"lvl":"5","reason":"11.5 УК","text":"5. Организованное ограбление в составе группы лиц."},{"lvl":"4","reason":"11.6 УК","text":"6. Нападение на режимный объект с целью совершения хищения материальных ценностей."},{"lvl":"5","reason":"11.7 УК","text":"7. Нападение на военный объект с целью совершения хищения огнестрельного оружия, боеприпасов, формы."}]},{"name":"Статья 12. Домогательство.","item":[{"lvl":"3","reason":"12.1 УК","text":"1. Совершение действий сексуального характера без проникновения в тело другого лица с использованием детородных органов."},{"lvl":"4","reason":"12.2 УК","text":"2. Совершение действий сексуального характера с проникновением в тело другого лица с использованием детородных органо"},{"lvl":"3","reason":"12.4 УК","text":"4. Принуждение или навязчивое соблазнение с признаками домогательства к совершению действий сексуального характера."}]},{"name":"Статья 13. Похищение.","item":[{"lvl":"3","reason":"13.1 УК","text":"1. Незаконное насильственное удержание человека против его воли (похищение) без идеологических или материальных целей."},{"lvl":"4","reason":"13.2 УК","text":"2. Незаконное насильственное удержание человека против его воли (похищение) в составе группы лиц."},{"lvl":"5","reason":"13.3 УК","text":"3. Незаконное насильственное удержание человека против его воли (похищение) с идеологическими или материальными целями."}]},{"name":"Статья 14. Убийство.","item":[{"lvl":"4","reason":"14.1 УК","text":"1. Убийство человека без применения огнестрельного, холодного оружия."},{"lvl":"5","reason":"14.2 УК","text":"2. Убийство человека с применением огнестрельного или холодного оружия."},{"lvl":"6","reason":"14.3 УК","text":"3. Убийство государственного служащего."},{"lvl":"6","reason":"14.4 УК","text":"4. Произведение серии убийств (больше двух человек) с или без применения оружия."},{"lvl":"6","reason":"14.5 УК","text":"5. Убийство человека при наличии идеологических, материальных (заказные убийства) или иных целей."},{"lvl":"3","reason":"14.6 УК","text":"6. Заведомо спланированные действия с целью нанесения травм, несовместимых с жизнью (покушение) человека."},{"lvl":"4","reason":"14.7 УК","text":"7. Заведомо спланированные действия с целью нанесения травм, несовместимых с жизнью (покушение) государственного служащего."}]},{"name":"Статья 15. Мошенничество.","item":[{"lvl":"3","reason":"15.1 УК","text":"1. Обман или заблуждение граждан с целью получения материальной выгоды."},{"lvl":"4","reason":"15.2 УК","text":"2. Выдача себя за государственного служащего с целью получения материальной или иной выгоды."},{"lvl":"4","reason":"15.3 УК","text":"3. Совершение фальсификации или подделки официальных документов."}]},{"name":"Статья 16. Коррупция.","item":[{"lvl":"4","reason":"16.1 УК","text":"1. Дача или попытка дачи взятки государственному служащему."},{"lvl":"5","reason":"16.2 УК","text":"2. Получение взятки государственным служащим от физического или юридического лица."},{"lvl":"3","reason":"16.3 УК","text":"3. Действия вне общественных или правовых интересов."}]},{"name":"Статья 17. Служебные преступления.","item":[{"lvl":"3","reason":"17.1 УК","text":"1. Использование должностных полномочий для получения личной выгоды."},{"lvl":"3","reason":"17.2 УК","text":"2. Совершение сотрудником государственного органа действий, выходящих за пределы его полномочий и повлёкших нарушение прав."},{"lvl":"4","reason":"17.3 УК","text":"3. Халатность к исполнению служебных обязанностей, в том числе небрежное отношение к табельному оружию, порученному автопарку."},{"lvl":"4","reason":"17.5 УК","text":"5. Моральное, психологическое или физическое давление сотрудником государственных органов с целью получения выгоды или информации."}]},{"name":"Статья 18. Уход от ответственности.","item":[{"lvl":"6","reason":"18.1 УК","text":"1. Попытка уйти от уголовной, административной или дисциплинарной ответственности, в том числе смена имени."},{"lvl":"3","reason":"18.3 УК","text":"3. Отказ от дачи показаний, если лицо является свидетелем преступления или совершило его."}]},{"name":"Статья 19. Огнестрельное оружие.","item":[{"lvl":"4","reason":"19.1 УК","text":"1. Хранение или ношение огнестрельного оружия без соответствующего разрешения."},{"lvl":"2","reason":"19.2 УК","text":"2. Демонстрация огнестрельного или холодного оружия в общественных местах, если оно не требуется для самозащиты"},{"lvl":"3","reason":"19.3 УК","text":"3. Применение огнестрельного или холодного оружия без законной на то причины."},{"lvl":"5","reason":"19.4 УК","text":"4. Сбыт или покупка огнестрельного оружия, боеприпасов к нему, материалов для производства оружия, а также деталей для их производства."},{"lvl":"4","reason":"19.5 УК","text":"5. Производство оружия, боеприпасов к нему в неспециализированных учреждениях без лицензии."},{"lvl":"2","reason":"19.6 УК","text":"6. Хранение материалов (более 500 единиц) или деталей для их производства."},{"lvl":"3","reason":"19.7 УК","text":"7. Перевозка крупнокалиберного оружия в багажном отделении транспортного средства с боеприпасами в количестве более 200 патрон."}]},{"name":"Статья 20. Наркотические вещества.","item":[{"lvl":"3","reason":"20.1 УК","text":"1. Несанкционированное (незаконное) хранение наркотических веществ или ингредиентов для их производства."},{"lvl":"3","reason":"20.2 УК","text":"2. Употребление наркотических веществ."},{"lvl":"4","reason":"20.3 УК","text":"3. Несанкционированный (незаконный) сбыт наркотических веществ."},{"lvl":"2","reason":"20.4 УК","text":"4. Несанкционированное (незаконное) приобретение наркотических веществ."},{"lvl":"5","reason":"20.5 УК","text":"5. Несанкционированное (незаконное) производство или выращивание наркотических веществ."}]},{"name":"Статья 21. Неподчинение правоохранительным органам.","item":[{"lvl":"2","reason":"21.1 УК","text":"1. Невыполнение законных требований представителя правоохранительных органов."},{"lvl":"4","reason":"21.2 УК","text":"2. Уход от сотрудников правоохранительных органов при проведении остановки транспорта или ареста, задержания."},{"lvl":"2","reason":"21.3 УК","text":"3. Помеха сотрудникам государственных органов при осуществлении ими служебной деятельности."},{"lvl":"2","reason":"21.4 УК","text":"4. Сопротивление при аресте с использованием толчков и любых других движений."},{"lvl":"4","reason":"21.5 УК","text":"5. Неисполнение постановлений и решений судебных инстанций."},{"lvl":"3","reason":"21.6 УК","text":"6. Неисполнение постановлений прокуратуры или препятствие её работе."}]},{"name":"Статья 22. Проникновение.","item":[{"lvl":"4","reason":"22.1 УК","text":"1. Проникновение на режимные объекты без соответствующего разрешения от старшего состава организации или законного права на это."},{"lvl":"2","reason":"22.2 УК","text":"2. Проникновение в служебные помещения с отказом покидать их по требованию сотрудника правоохранительных органов."},{"lvl":"6","reason":"22.3 УК","text":"3. Пролёт или проникновение на территорию военных объектов без разрешения от офицерского состава."},{"lvl":"4","reason":"22.4 УК","text":"4. Отказ от требования сотрудника правоохранительных органов покидать место, где было совершено преступление."},{"lvl":"2","reason":"22.5 УК","text":"5. Проникновение в транспорт сотрудников правоохранительных органов и отказ покидать его по их требованию."}]},{"name":"Статья 23. Незаконное предпринимательство.","item":[{"lvl":"3","reason":"23.1 УК","text":"1. Оказание нелицензированных предпринимательских услуг физическим или юридическим лицам."},{"lvl":"2","reason":"23.2 УК","text":"2. Организация незаконного игорного бизнеса без наличия лицензии."},{"lvl":"3","reason":"23.3 УК","text":"3. Оказание адвокатских услуг без наличия разрешения от уполномоченных органов."}]},{"name":"Статья 24. Терроризм.","item":[{"lvl":"6","reason":"24.1 УК","text":"1. Участие в террористическом акте вне зависимости от его целей."},{"lvl":"6","reason":"24.2 УК","text":"2. Организация террористического акта с идеологическими, материальными или религиозными целями."},{"lvl":"6","reason":"24.3 УК","text":"3. Хранение или производство взрывчатых веществ."}]},{"name":"Статья 25. Политические преступления.","item":[{"lvl":"3","reason":"25.1 УК","text":"1. Организация или участие в митинге, акции протеста или пикете без полученного разрешения от соответствующего органа."},{"lvl":"6","reason":"25.2 УК","text":"2. Организация или участие в митинге, акции протеста или пикете с целью свержения власти."},{"lvl":"6","reason":"25.4 УК","text":"4. Свержение действующей власти или попытка свержения."},{"lvl":"6","reason":"25.5 УК","text":"5. Подрыв, угроза целостности конституционного строя государства."},{"lvl":"4","reason":"25.6 УК","text":"6. Призыв (агитация) к нарушению пунктов 1, 2, 3, 4, 5 настоящей статьи."}]},{"name":"Статья 26. Организация преступной группировки.","item":[{"lvl":"5","reason":"26.1 УК","text":"1. Участие в преступном сообществе, нарушающем действующее законодательство."},{"lvl":"6","reason":"26.2 УК","text":"2. Организация преступного сообщества для извлечения той или иной выгоды."}]},{"name":"Статья 27. Защита государственной тайны.","item":[{"lvl":"6","reason":"27.1 УК","text":"1. Получение или распространение в общественный доступ материалов, содержащих государственную тайну."},{"lvl":"4","reason":"27.2 УК","text":"2. Популяризация (распространение) в массы сведений, содержащих государственную тайну, без участия в незаконном их получении."},{"lvl":"6","reason":"27.3 УК","text":"3. Раскрытие государственной тайны, ограниченной правительством информации или других сведений, подрывающих национальную безопасность."}]},{"name":"Статья 28. Государственная измена.","item":[{"lvl":"6","reason":"28.1 УК","text":"1. Совершение деяния, в результате которого нанесён ущерб или угроза суверенитету, территориальной целостности и неприкосновенности и т.д."},{"lvl":"4","reason":"28.2 УК","text":"2. Надругательство над государственными символами (символикой) Республики Мираж, их дискредитация, проявление к ним неуважения и т.д."}]},{"name":"Статья 29. Финансовые преступления.","item":[{"lvl":"6","reason":"29.1 УК","text":"1. Узаконивание (отмывание) денег или других финансовых активов, полученных в ходе преступной деятельности."},{"lvl":"4","reason":"29.2 УК","text":"2. Производство или использование поддельных денег."},{"lvl":"5","reason":"29.3 УК","text":"3. Неуплата, отказ, уклонение от уплаты налогов или штрафных санкций, предусмотренных действующим законодательством."},{"lvl":"6","reason":"29.4 УК","text":"4. Признанная неразумной или несанкционированной растрата средств из государственного бюджета сотрудниками государственных служб."}]},{"name":"Статья 30. Слежка.","item":[{"lvl":"2","reason":"30.1 УК","text":"1. Ведение незаконной целенаправленной слежки за гражданином Республики Мираж с целью получения информации о его личной жизни."},{"lvl":"4","reason":"30.2 УК","text":"2. Преследование сотрудника правоохранительных органов или военного транспорта."},{"lvl":"2","reason":"30.3 УК","text":"3. Ведение незаконной видеофиксации или фотофиксации лица вситуациях, когда он выступает против этого."},{"lvl":"4","reason":"30.4 УК","text":"4. Ведение незаконной видеофиксации или фотофиксации на территориях Министерства Юстиции, Вооружённых Сил Республики Мираж, где запрет."}]},{"name":"Статья 31. Ввод в заблуждение следствия.","item":[{"lvl":"3","reason":"31.1 УК","text":"1. Дача ложных показаний с целью оправдать человека или обмануть следствие, затруднить досудебный, судебный процесс."},{"lvl":"2","reason":"31.2 УК","text":"2. Заведомо ложный вызов правоохранительных органов, скорой медицинской помощи."},{"lvl":"2","reason":"31.3 УК","text":"3. Целенаправленный ложный донос правоохранительным органам на несуществующее нарушение."}]}]