[{"name":"Глава 1. Не вооруженное нападение","item":[{"reason":"1.1 УК","lvl":"3","text":"1.1 за нападение на гражданское лицо, преступнику присваивается 3-ий уровень розыска."},{"reason":"1.2 УК","lvl":"6","text":"1.2 За нападение на государственного служащего преступнику присваивается 6-ый уровень розыска."}]},{"name":"Глава 2. Вооруженное нападение.","item":[{"reason":"2.1 УК","lvl":"6","text":"2.1 За вооруженное нападение преступнику присваивается 6-ой уровень розыска, а также изымается лицензия на оружие."}]},{"name":"Глава 3. Убийство","item":[{"text":"3.1 За убийство преступнику присваивается 6 уровень розыска, а также изымается лицензия на оружие.","lvl":"6","reason":"3.1 УК"},{"text":"3.2 За покушение с использованием огнестрельного оружия, преступнику присваивается 5 уровень розыска.","lvl":"5","reason":"3.2 УК"}]},{"name":"Глава 4. Оскорбление сотрудников государственных служащих.","item":[{"text":"4.1 За любой вид оскорбления государственных служащих при исполнении,нарушителю присваивается 3 уровень розыска.","lvl":"4","reason":"4.1 УК"},{"text":"4.2 За неадекватное поведение в сторону государственных служащих при исполнении , нарушителю присваивается 3 уровень розыска.","lvl":"3","reason":"4.2 УК"}]},{"name":"Глава 5. Отказ от предоставления документов.","item":[{"text":"5.1 За отказ, нежелание гражданина от предоставления документов, удостоверяющих личность сотруднику правоохранительных органов/военнослу","lvl":"2","reason":"5.1 УК "},{"text":"5.2 За отказ, нежелание гражданина от предоставления документов , удостоверяющих личность сотруднику правоохранительных органов в ситуаци","lvl":"6","reason":"5.2 УК"}]},{"name":"Глава 6. Неподчинение.","item":[{"text":"6.1 За неподчинение сотруднику правоохранительных органов/военнослужащим МО/сотрудникам ТСР, находящемуся при исполнении,преступнику при","lvl":"4","reason":"6.1 УК"},{"text":"6.2 За неподчинению сотруднику правоохранительных органов/военнослужащим МО/сотрудникам ТСР при обстановке ЧС в штате, а так же при проведе","lvl":"6","reason":"6.1 УК"},{"text":"6.3 За отказ или невозможность оплатить штраф, гражданину присваивается 3 уровень розыска, после чего он задерживается.","lvl":"3","reason":"6.3 УК"},{"text":"6.4 За попытку удаления/удаление/порчу любого рода маячков, жучков, браслетов, определяющих местоположение, которыми сотрудники ФБР огранич","lvl":"6","reason":"6.4 УК"}]},{"name":"Глава 7. Помеха","item":[{"text":"7.1 За помеху сотруднику правоохранительных органов/военнослужащим МО/сотрудникам ТСР, находящемуся при исполнении,преступнику присваива","lvl":"3","reason":"7.1 УК"}]},{"name":"Глава 8. Угрозы ","item":[{"text":"8.1 За угрозы гражданину штата, нарушителю присваивается 3-ый уровень розыска","lvl":"3","reason":"8.1 УК"},{"text":"8.2 За угрозы государственному служащему при исполнении, нарушителю присваивается 4-ый уровень розыска","lvl":"4","reason":"8.2 УК"},{"text":"8.3 За угрозы руководству государственных организаций, нарушителю присваивается 6-ый уровень розыскаИсключение: Министерство Юстиции при ","lvl":"6","reason":"8.3 УК"}]},{"name":"Глава 9. Проникновение ","item":[{"text":"9.1 За проникновение на охраняемую правоохранительными органами территорию (Гараж и участок ПД; гараж, офис ФБР и территория прилежащие офи","lvl":"3","reason":"9.1 УК"},{"text":"9.2 За проникновение на частную территорию без разрешения владельца, преступнику присваивается 2 уровень розыска.","lvl":"2","reason":"9.2 УК"},{"text":"9.3 За проникновение на территорию закрытой военной базы (Территория San Fierro Army, Los Santos Port; территория Тюрьмы Строгого Режима), преступнику при","lvl":"6","reason":"9.3 УК"}]},{"name":"Глава 10. Угон транспортного средства ","item":[{"text":"10.1 За попытку угона государственного или частного транспортного средства, преступнику присваивается 2 уровень розыска.","lvl":"2","reason":"10.1 УК"},{"text":"10.2 За угон транспортного средства, преступнику присваивается 4 уровень розыска.","lvl":"4","reason":"10.2 УК"}]},{"name":"Глава 11. Наезд транспортным средством.","item":[{"text":"11.1 За наезд транспортным средством на гражданское лицо, преступнику присваивается3 уровень розыск, с изъятием лицензии на вождение.","lvl":"3","reason":"11.1 УК"},{"text":"11.2 За наезд транспортным средством на сотрудника правоохранительных органов,преступнику присваивается 6 уровень розыска, с изъятием лице","lvl":"6","reason":"11.2 УК"}]},{"name":"Глава 12. Кража ","item":[{"text":"12.1 За кражу частного имущества, преступнику присваивается 4 уровень розыска.","lvl":"4","reason":"12.1 УК"},{"text":"12.2 За кражу государственной собственности, собственности гос.организаций,имущества, материалов, преступнику присваивается 6 уровень розы","lvl":"6","reason":"12.2 УК"}]},{"name":"Глава 13. Вымогательство","item":[{"text":"13.1 За вымогательство денежных средств, частной собственности, преступнику присваивается 4 уровень розыска.","lvl":"4","reason":"13.1 УК"},{"text":"13.2 За вымогательство денежных средств, частной собственности должностным лицом, такому лицу присваивается6 уровень розыска, увольнение и","lvl":"6","reason":"13.2 УК"}]},{"name":"Глава 14. Воровство государственного имущества.","item":[{"text":"14.1 За кражу государственного имущества (патроны, одежда и т.д.) с военных объектов и зданий государственного значения, преступнику присваив","lvl":"6","reason":"14.1 УК"},{"text":"14.2 За использование государственного имущества (форма, рация, ключи от ворот в полицейских участках/армиях и тд) гражданским лицом не имеющ","lvl":"6","reason":"14.2"}]},{"name":"Глава 15. Продажа государственного имущества.","item":[{"text":"15.1 За продажу государственного имущества (патроны, одежда и т.д.) с военных объектов и зданий государственного значения, преступнику присва","lvl":"6","reason":"15.1 УК"},{"text":"15.2 За продажу государственного имущества государственным служащим (патроны, одежда и т.д.) с военных объектов и зданий государственного зн","lvl":"6","reason":"15.2 УК"}]},{"name":"Глава 16. Наркотические вещества","item":[{"text":"16.1 За хранение и/или перевозку наркотических средств, преступнику присваивается 5 уровень розыска, а так же изъятие наркотических средств. ","lvl":"5","reason":"16.1 УК"},{"text":"16.2 За сбыт и попытку приобрести наркотические средства, преступнику присваивается 6 уровень розыска и изъятие наркотических средств","lvl":"6","reason":"16.2 УК"},{"text":"16.3 За употребление наркотических средств, преступнику присваивается 6 уровень розыска и изъятие наркотических средств.","lvl":"6","reason":"16.3 УК"},{"text":"16.4 За употребление и хранение наркотических веществ государственными сотрудниками, сотрудник подлежит увольнению с занесением в Черный с","lvl":"6","reason":"16.4 УК"},{"text":"16.5 За хранение семян содержащих наркотические вещества, преступнику присваивается 3-й уровень розыска.","lvl":"5","reason":"16.5 УК"},{"text":"16.6 За рассадку наркотических семян, преступнику присваивается 4-й уровень розыска.","lvl":"4","reason":"16.6 УК"},{"text":"16.7 За хранение адреналина содержащего наркотические вещества, преступнику присваивается 3-й уровень розыска.","lvl":"3","reason":"16.7 УК"}]},{"name":"Глава 17. Оружие.","item":[{"text":"17.1 За ношение оружия в открытом виде, преступнику присваивается 3 уровень розыска.","lvl":"3","reason":"17.1 УК"},{"text":"17.2 За ношение оружия без лицензии, преступнику присваивается 6 уровень розыска.(Исключение сотрудник МО, если он в форме).","lvl":"6","reason":"17.2 УК"},{"text":"17.3 За нелегальную покупку/продажу оружия, преступнику присваивается 6 уровня розыска, а также изымается лицензия на оружие и все оружие, ко","lvl":"6","reason":"17.3 УК"},{"text":"17.4 В случае обнаружения у задержанного патронов (материалов), и в случае если у гражданина нету лицензии на оружие, присваивается 3 уровень ","lvl":"3","reason":"17.4 УК"},{"text":"17.5 За нелегальную покупку/продажу патронов (материалов), преступнику присваивается 5-й уровень розыска и изъятие всех патронов.","lvl":"5","reason":"17.5 УК"}]},{"name":"Глава 18. Терроризм ","item":[{"text":"18.1 За планирование/исполнение теракта, преступнику присваивается 6 уровень розыска.","lvl":"6","reason":"18.1 УК"},{"text":"18.2 За подозрение в теракте или его попытке, преступнику присваивается 6 уровень розыска.","lvl":"6","reason":"18.2 УК"},{"text":"18.3 За пребывание в террористической группировке, преступнику присваивается 6 уровень розыска.","lvl":"6","reason":"18.3 УК"},{"text":"18.4 За вербовку в террористическую группировку, вербующему присваивается 6 уровень розыска.","lvl":"6","reason":"18.4 УК"},{"text":"18.5 За помощь/финансирование/исполнение теракта нарушителю присваивается 6 уровень розыска.","lvl":"6","reason":"18.5 УК"}]},{"name":"Глава 19. Взятие в заложники.","item":[{"text":"19.1 За взятие одного или группы заложников, преступнику присваивается 6 уровень розыска.","lvl":"6","reason":"19.1 УК"}]},{"name":"Глава 20. Митинг.","item":[{"text":"20.1. За вооруженное насилие, а так же призывы к насилию, порчу гос. имущества на митингах, преступнику присваивается 6 уровень розыска.","lvl":"6","reason":"20.1 УК"},{"text":"20.2 За участие в несанкционированном митинге преступнику присваивается 2-й уровень розыска.","lvl":"2","reason":"20.2 УК"},{"text":"20.2.3. Митинг считается несанкционированным, если за него не была внесена сумма в размере 50.000.000$ в казну Центрального Банка.","lvl":"1","reason":"20.2.3 УК"},{"text":"20.2.2. Митинг считается несанкционированным, если он проводится за пределами главной площади Центрального Банка.","lvl":"1","reason":"20.2.2 УК"},{"text":"20.2.3. Митинг будет считатся несанкционированным, если применяют любой вид оружия и гранат.","lvl":"1","reason":"20.2.3 УК"}]},{"name":"Глава 21. Экстремизм.","item":[{"text":"21.1 За призыв к экстремизму, нарушителю присваивается 6-ый уровень розыска.","lvl":"6","reason":"21.1 УК"},{"text":"21.2 За проявления экстремизма, нарушителю присваивается 6-ый уровень розыска.","lvl":"6","reason":"21.2"},{"text":"21.3 За пребывание в экстремистской группировке преступнику присваивается 6 уровень розыска, а также вживляется маячок, по которому можно уз","lvl":"6","reason":"21.3 УК"},{"text":"21.4 За вербовку в экстремистскую группировку, вербующему присваивается 6 уровень розыска.","lvl":"6","reason":"21.4 УК"},{"text":"21.5 За помощь/финансирование экстремистской группировки нарушителю присваивается 6 уровень розыска.","lvl":"6","reason":"21.5 УК"}]},{"name":"Глава 22. Нацизм.","item":[{"text":"22.1 За призыв к нацизму, нарушителю присваивается 3-ый уровень розыска.","lvl":"3","reason":"22.1 УК"},{"text":"22.2 За проявления нацизма, нарушителю присваивается 3-ый уровень розыска","lvl":"3","reason":"22.2 УК"},{"text":"22.3 За пребывание в в национал-социалистической партии, преступнику присваивается 6 уровень розыска.","lvl":"6","reason":"22.3 УК"},{"text":"22.4 За вербовку в национал-социалистическую партию, вербующему присваивается 6 уровень розыска.","lvl":"6","reason":"22.4 УК"},{"text":"22.5 За помощь/финансирование национал-социалистической партии присваивается нарушителю 6 уровень розыска.","lvl":"6","reason":"22.5 УК"}]},{"name":"Глава 23. Сотрудничество лиц гос.организаций с ОПГ.","item":[{"text":"23.1 За сотрудничество лиц гос.организаций с нелегальной организованной группировкой, нарушителю присваивается 6 уровень розыска и ЧС орган","lvl":"6","reason":"23.1 УК"}]},{"name":"Глава 24. Проституция.","item":[{"text":"24.1 За занятие проституцией, нарушителю присваивается 2 уровень розыска.","lvl":"2","reason":"24.1 УК"},{"text":"24.2 За вовлечение в занятие проституцией, нарушителю присваивается 3 уровень розыска.","lvl":"3","reason":"24.2 УК"},{"text":"24.3 Запрещены любые насильственные действия в сторону гражданских лиц и лиц гос. организаций","lvl":"6","reason":"24.3 УК"}]},{"name":"Глава 25. Пиратство.","item":[{"text":"25.1 Нападение на морской или наземный транспорт в целях завладения чужим имуществом, совершенное с применением насилия либо с угрозой, нару","lvl":"6","reason":"25.1 УК"}]},{"name":"Глава 26. Незаконное занятие рыбным/животным добывающим промыслом (браконьерство).","item":[{"text":"26.1 За осуществление рыболовной деятельности с рыбацкого катера без наличия соответствующей лицензии, дающую на это право, гражданину буде","lvl":"2","reason":"26.1 УК"},{"text":"26.2 За осуществление охоты без наличия соответствующей лицензии, дающей на это право, гражданину будет присвоено 2 уровень розыска после ко","lvl":"2","reason":"26.2 УК"}]},{"name":"Глава 27. Соучастие.","item":[{"text":"27.1 За соучастие в правонарушении, преступнику присваивается 2 уровень розыскаПримечание: а также розыск за статью, по которой он является ","lvl":"2","reason":"27.1 УК"}]},{"name":"Глава 28. Взятка и давление.","item":[{"text":"28.1 За дачу или попытку дачи взятки должностному лицу, гражданину присваивается 3 уровень розыска.","lvl":"3","reason":"28.1 УК"},{"text":"28.2 За получение или попытку получения взятки должностным лицом, ему присваивается 5 уровень розыска, увольнение из организации, занесение ","lvl":"5","reason":"28.5 УК"},{"text":"28.3 За давление на сотрудника правоохранительных органов, преступнику присваивается 2 уровень розыска.Исключение: Министерство Юстиции в ","lvl":"2","reason":"28.3 УК"},{"text":"28.4 В качестве проверки на коррумпированные действия, участники антикоррупционной службы имеют право предложить дать взятку и взять ее. Пр","lvl":"1","reason":"28.4 УК"}]},{"name":"Глава 29. Дача ложных показаний.","item":[{"text":"29.1 За дачу заведомо ложных показаний сотрудникам правоохранительных органов, нарушителю присваивается 3 уровень розыска.","lvl":"3","reason":"29.1 УК"}]},{"name":"Глава 30. Превышение должностных полномочий.","item":[{"text":"30.1 За превышение должностных полномочий с корыстной целью, должностному лицу присваивается 6 уровень розыска с занесением в Черный Список.","lvl":"6","reason":"30.1 УК"},{"text":"30.2 За присвоение гражданским , государственным служащим или муниципальным служащим, не являющимся должностным лицом, полномочий должност","lvl":"4","reason":"30.2 УК"}]},{"name":"Глава 31. Преступления против основ конституционного строя и безопасности государства.","item":[{"text":"31.1 Посягательство на жизнь государственного или общественного деятеля, совершенное в целях прекращения его государственной или иной поли","lvl":"6","reason":"31.1 УК"},{"text":"31.2 Действия, направленные на насильственный захват власти или насильственное удержание власти, а равно вооруженный мятеж, в нарушение Кон","lvl":"6","reason":"31.2 УК"},{"text":"31.3 Разглашение сведений, составляющих государственную тайну, лицом, которому она была доверена или стала известна по службе, работе, если э","lvl":"6","reason":"31.3 УК"}]},{"name":"Глава 32. Преступления против судебной системы.","item":[{"text":"32.1 Действие, в ходе которого лицо сознательно не является на судебное заседание по выданной судом повестке.- Наказывается штрафом на сумму","lvl":"1","reason":"32.1 УК"},{"text":"32.2 Действие, в ходе которого лицо намеренно даёт ложные показания следствию, с целью загнать в тупик/приостановить следствие.- Наказываетс","lvl":"3","reason":"32.2"},{"text":"32.3 Неисполнение постановления прокуратуры, приговора суда, решения суда или иного судебного акта.- Наказывается лишением свободы на срок ","lvl":"3","reason":"32.3 УК"},{"text":"32.4 Побег из места лишения свободы, из-под ареста или из-под стражи, преступнику присваивается 6 уровень розыска.","lvl":"6","reason":"32.4 УК"},{"text":"32.5 Подкуп или принуждение к даче показаний или уклонению от дачи показаний либо к неправильному переводу- Наказывается лишением свободы д","lvl":"4","reason":"32.5 УК"},{"text":"32.6 Незаконные задержание, заключение под стражу или содержание под стражей.- Наказывается лишением свободы на срок до трёх лет.","lvl":"3","reason":"32.6 УК"},{"text":"32.7 Привлечение заведомо невиновного к уголовной ответственности или незаконное возбуждение уголовного дела.- Наказывается лишением своб","lvl":"2","reason":"32.7 УК"},{"text":"32.8 Клевета в отношении судьи, присяжного заседателя, прокурора, лица, производящего дознание.- Наказывается лишением свободы до трёх лет.","lvl":"3","reason":"32.8 УК"},{"text":"32.9 Действие, в ходе которого лицо сознательно отказывается от предоставления на суде доказательств по выданному запросу.- Наказывается ли","lvl":"2","reason":"32.9 УК"},{"text":"32.10 Действия, в ходе которого подсудимый пытается избежать наказание, будь то смена паспорта, либо выезд из штата, карается наложением 6 уро","lvl":"6","reason":"32.10 УК"}]},{"name":"Глава 33. Явка с повинной.","item":[{"text":"33.1 За явку с повинной с 2-4 уровнем розыска, преступнику снимается один уровень розыска.","lvl":"1","reason":"33.1 УК"},{"text":"33.2 За явку с повинной с 5-6 уровнем розыска, преступнику снимается два уровня розыска.","lvl":"2","reason":"33.2 УК"}]},{"name":"Глава 34. Ложный вызов.","item":[{"text":"34.1 Ложный или неадекватный вызов сотрудников министерства юстиции через 911,будет караться лишением свободы от 3 до 4 лет.","lvl":"4","reason":"34.1 УК"}]},{"name":"Глава 35. База данных преступников.","item":[{"text":"35.1 Взлом базы данных преступников - 6 уровень розыска.","lvl":"6","reason":"35.1 УК"},{"text":"35.2 Незаконное вынесение с базы данных преступников - 6 уровень розыска с занесением в Черный Список Министерства Юстиций.","lvl":"6","reason":"35.2 УК"}]},{"name":"Глава 36. Дубликаты ключа от КПП ТСР/Автомобилей граждан/поддельные документы.","item":[{"text":"36.1 За попытку создания, или создание дубликата ключа от двери КПП ТСР, преступнику присваивается 3 уровень розыска, а так-же изъятие дублика","lvl":"3","reason":"36.1 УК"},{"text":"36.2 За сбыт и попытку приобрести дубликат ключа от двери КПП ТСР, преступнику присваивается 6 уровень розыска, а так-же изъятие дубликатов кл","lvl":"6","reason":"36.2 УК"},{"text":"36.3 За использование дубликата ключа от двери КПП ТСР, или побег из Тюрьмы Строгого Режима, преступнику присваивается 6 уровень розыска,а та","lvl":"6","reason":"36.3 УК"},{"text":"36.4 За хранение и/или перевозку дубликата ключа от КПП ТСР, преступнику присваивается 3 уровень розыска, а так-же изъятие дубликатов ключа","lvl":"3","reason":"36.4 УК"},{"text":"36.5 За изготовления поддельных документов, преступнику присваивать 6 уровень розыска","lvl":"6","reason":"36.5 УК"},{"text":"36.6 За попытку изготовления или изготовление дубликатов ключей от автомобилей граждан преступнику присваивается 3ий уровень розыска.","lvl":"3","reason":"36.6 УК"}]},{"name":"Глава 37. Государственная связь и ее прерывания.","item":[{"text":"37.1 Незаконный захват теле и радио вышек связи - 6 уровень розыска.","lvl":"6","reason":"37.1 УК"},{"text":"37.2 Незаконное прерывания вещания и передачи радио волн - 6 уровень розыска","lvl":"6","reason":"37.2 УК"},{"text":"37.3 Незаконное прослушивание или прерывание гос. связи - 6 уровень розыска","lvl":"6","reason":"37.3 УК"},{"text":"37.4 Незаконный сбыт или покупка средств для глушения передач радио и других волн - 4 уровень розыска.","lvl":"4","reason":"37.4 УК"}]},{"name":"Глава 38. Раскрытие Государственной Тайны.","item":[{"text":"38.1 За незаконное получение/попытку получения доступа к информации, составляющую государственную тайну, нарушителю присваивается 5-ый уров","lvl":"5","reason":"38.1 УК"},{"text":"38.2 За разглашение информации, составляющую государственную тайну нарушителю присваивается 6-ой уровень розыска, отстранение от занимаемы","lvl":"6","reason":"38.2 УК"},{"text":"38.3 За попытку разглашения информации составляющую государственную тайну, преступнику присваивается 5-ый уровень розыска, отстранение от з","lvl":"5","reason":"38.3 УК"}]},{"name":"Глава 39. Применение обороны/самообороны.","item":[{"text":"39.1 В случаи невооружённого нападение, человек имеет право применить оборону/самооборону и напасть в ответ.","lvl":"1","reason":"39.1 УК"},{"text":"39.2 В случаи вооружённого нападения, человек имеет право применить оборону/самооборону и в ответ использовать оружия против преступника.","lvl":"1","reason":"39.2 УК"},{"text":"39.3 Запрещено превышать оборону/самооборону, например использовать оружия против преступника, который не применяет оружие, бить человека д","lvl":"1","reason":"39.3 УК"},{"text":"39.4 В случаи применения обороны/самообороны, которая не нарушает главу 41 УК, человек не может быть наказан по главам 1, 2, 3 УК.","lvl":"1","reason":"39.4 УК"}]},{"name":"Глава 40. Хулиганство.","item":[{"text":"40.1 За любой вид хулиганства, то есть грубое нарушение общественного порядка, выражающее явное неуважение к обществу - нарушителю присваива","lvl":"2","reason":"40.1 УК"},{"text":"40.2 За любой вид хулиганства, то есть грубое нарушение общественного порядка, выражающее явное неуважение к обществу, совершенное с примене","lvl":"3","reason":"40.2 УК"},{"text":"40.3 То же деяние, совершенное с применением оружия или предметов, используемых в качестве оружия, либо группой лиц, группой лиц по предварит","lvl":"4","reason":"40.3 УК"}]},{"name":"Глава 41. Сотрудничество со следствием.","item":[{"text":"41.1 За сведения или иной вид сотрудничества со следствием, которые обладают большой ценностью для правоохранительных органов и могут помоч","lvl":"1","reason":"41.1 УК"},{"text":"41.2 За сведения или иной вид сотрудничества со следствием, которые обладают частичной ценностью для правоохранительных органов, преступни","lvl":"2","reason":"41.2 УК"},{"text":"41.2. За сведения или иной вид сотрудничества со следствием, которые не обладают большой ценностью, но могут быть полезны следователю, престу","lvl":"1","reason":"41.2 УК"}]},{"name":"Глава 42. Домогательство.","item":[{"text":"42.1 За домогательство на гражданское лицо, преступнику присваивается 2-ой уровень розыска.","lvl":"2","reason":"42.1 УК"},{"text":"42.2 За домогательство на государственного служащего преступнику присваивается 5-ый уровень розыска.","lvl":"5","reason":"42.2 УК"}]},{"name":"Глава 43. Грабёж и разбой.","item":[{"text":"43.1 За грабёж, преступнику присваивается 3 уровень розыска.","lvl":"3","reason":"43.1 УК"},{"text":"43.2 За грабеж в крупном размере, преступнику присваивается 6 уровень розыска. (Больше 3.000.000$)","lvl":"6","reason":"43.2 УК"},{"text":"43.3 За разбой, преступнику присваивается 4 уровень розыска, а также штрафная санкция 5.000.000$","lvl":"4","reason":"43.3 УК"},{"text":"43.4 За разбой в крупном размере, преступнику присваивается 6 уровень розыска. (Больше 3.000.000$), а так же штрафная санкция 7.000.000$","lvl":"6","reason":"43.4 УК"},{"text":"43.5 За разбой и/или грабёж группой лиц (Больше 2 людей), каждому участнику присваивается 6 уровень розыска, независимо от тяжести. Также следу","lvl":"6","reason":"43.5 УК"}]},{"name":"Глава 44. Уничтожение улик, совершённого преступления.","item":[{"text":"44.1 За уничтожение или попытку уничтожения улик, оставленных в ходе совершённого правонарушения, преступнику присваивается 4-ый уровень ро","lvl":"4","reason":"44.1 УК"}]}]