[{"name":"Раздел 1. Преступления против личности.","item":[{"lvl":"3","reason":"1.1 УК","text":"1.1. Нанесение вреда жизни и здоровью человека, равно как посягательство на нанесение вреда жизни и здоровью человека."},{"lvl":"5","reason":"1.2 УК","text":"1.2. Нанесение вреда жизни и здоровью человека с использованием холодного, огнестрельного, взрывного оружия, а также транспорта."},{"lvl":"2","reason":"1.3 УК","text":"1.3. Деяние, направленное на публичное унижение чести и достоинства человека."},{"lvl":"4","reason":"1.4 УК","text":"1.4. Временное незаконное ограничение свободы перемещения гражданина с целью получения выкупа или достижения иных финансовых достижений."},{"lvl":"1","reason":"1.5 УК","text":"1.5. Деяния, направленные на получение личных выгод от гражданина с использованием психологического давления."},{"lvl":"3","reason":"1.6 УК","text":"1.6. Принуждение к половому сношению без согласия жертвы."},{"lvl":"2","reason":"1.7 УК","text":"1.7. Нанесение ущерба репутации человека путем публичного преднамеренного освещения недостоверной информации."},{"lvl":"3","reason":"1.8 УК","text":"1.8. Принуждение к совершению или не совершению определенных действий в обмен на не распространение порочащей репутацию гражданина."},{"lvl":"2","reason":"1.9 УК","text":"1.9. Незаконная установка прослушивания, наблюдения за гражданином, равно как применение иных средств для получения личной информации."},{"lvl":"4","reason":"1.10 УК","text":"1.10. Необеспечение работодателем безопасных условий труда, соответствующих государственным нормативным требованиям и стандартам."},{"lvl":"5","reason":"1.11 УК","text":"1.11. Умышленное нанесение вреда жизни человека, повлекшее летальный исход."},{"lvl":"3","reason":"1.12 УК","text":"1.12. Нанесение вреда жизни человека, повлекшее летальный исход по неосторожности."},{"lvl":"5","reason":"1.13 УК","text":"1.13. Умышленное нанесение вреда жизни двум и более людям, повлекшее летальный исход."},{"lvl":"5","reason":"1.14 УК","text":"1.14. Самовольное присвоение гражданином полномочий должностного лица."},{"lvl":"3","reason":"1.16 УК","text":"1.16. За наезд транспортным средством на гражданское лицо."}]},{"name":"Раздел 2. Преступления против имущества и иные преступления в сфере экономики.","item":[{"lvl":"1","reason":"2.1 УК","text":"2.1. Проникновение, либо посещение частной собственности гражданина без его согласия."},{"lvl":"2","reason":"2.2 УК","text":"2.2. Завладение и\/или управление транспортным средством не принадлежащим гражданину без разрешения от владельца."},{"lvl":"2","reason":"2.3 УК","text":"2.3. Скрытое завладение имуществом гражданина, без его согласия."},{"lvl":"3","reason":"2.4 УК","text":"2.4. Открытое завладение имуществом гражданина, без его согласия."},{"lvl":"5","reason":"2.5 УК","text":"2.5. Приобретение\/хранение\/продажа имущества, заведомо полученное преступным путем. "},{"lvl":"4","reason":"2.6 УК","text":"2.6. Вымогательство имущества, услуг, финансов и иного, путем применения угроз, физического насилия, порчи имущества."},{"lvl":"4","reason":"2.7 УК","text":"2.7. Получение имущества, денежных средств гражданина, компании, государственной организации путём обмана или злоупотреблением доверия."},{"lvl":"1","reason":"2.8 УК","text":"2.8. Деяние, повлекшее значительные механические повреждения имущества."},{"lvl":"1","reason":"2.9 УК","text":"2.9. Невыполнение своих обязательств перед кредитором. Применимо только через день после предупреждения гражданина."},{"lvl":"6","reason":"2.10 УК","text":"2.10. Массовое спланированное нападение на государственных учреждения, с целью кражи в особо крупных размеров валюты и финансовых бумаг."},{"lvl":"2","reason":"2.11 УК","text":"2.11. Нарушение действующих требований к осуществлению предпринимательской деятельности."},{"lvl":"6","reason":"2.12 УК","text":"2.12. Нападение на морское или речное судно в целях завладения чужим имуществом, совершенное с применением насилия либо с угрозой."}]},{"name":"Раздел 3. Преступления против общественного порядка, нравственности и здоровья. ","item":[{"lvl":"2","reason":"3.1 УК","text":"3.1. Неуважение к обществу: брань, курение, нужда, опьянение (от 2 промилле), оскорбления, порча имущества. Применимо после предупреждения."},{"lvl":"2","reason":"3.2 УК","text":"3.2. Ношение элементов одежды, позволяющих скрывать личность, за исключением элементов одежды, предписанных медицинскими показаниями."},{"lvl":"3","reason":"3.3 УК","text":"3.3. Владение, хранение при себе, в имуществе, транспорте, а также использование психотропных и наркотических веществ."},{"lvl":"4","reason":"3.4 УК","text":"3.4. Продажа, дарение и иные способы сбыта, распространения психотропных и наркотических веществ."},{"lvl":"4","reason":"3.5 УК","text":"3.5. Выращивание, обработка, фасовка психотропных и наркотических веществ с целью сбыта или личного использования."},{"lvl":"2","reason":"3.6 УК","text":"3.6. Оказание сексуальных услуг, равно как и принуждение к оказанию этих услуг, равно как и предоставление помощи в оказании данных услуг."},{"lvl":"2","reason":"3.7 УК","text":"3.7. Препятствование сбору информации журналистом, за исключением личной информации граждан, служебной информации, государственной тайны."},{"lvl":"2","reason":"3.8 УК","text":"3.8. Дискриминация по взглядам, ориентации, гендеру, расе, национальности и неуважение к этим лицам."},{"lvl":"3","reason":"3.9 УК","text":"3.9. За осуществление рыболовной деятельности с рыбацкого катера без наличия соответствующей лицензии, дающую на это право."}]},{"name":"Раздел 4. Преступления против правосудия.","item":[{"lvl":"3","reason":"4.1 УК","text":"4.1. Акт преднамеренного неповиновения законному требованию должностного лица."},{"lvl":"5","reason":"4.2 УК","text":"4.2. Акт физического сопротивления, равно как попытка ухода от задержания или ареста, должностному лицу."},{"lvl":"4","reason":"4.3 УК","text":"4.3. Унижение личности сотрудника государственных структур, связанное с родом деятельности и занимаемой должностью сотрудника."},{"lvl":"2","reason":"4.4 УК","text":"4.4. Отказ в предоставлении документов, позволивших бы установить личность человека."},{"lvl":"2","reason":"4.5 УК","text":"4.5. Действия, направленные на приостановление, усложнение или замедление выполнения должностных полномочий государственным служащим."},{"lvl":"2","reason":"4.6 УК","text":"4.6. Отказ от уплаты штрафа, равно как и финансовая невозможность для оплаты штрафа."},{"lvl":"3","reason":"4.7 УК","text":"4.7. Действия повлекшие упущение должностным лицом задержанного или арестованного."},{"lvl":"2","reason":"4.8 УК","text":"4.8. Действия направленные на помеху проведению судебного процесса, равно как и оскорбление участников процесса."},{"lvl":"4","reason":"4.9 УК","text":"4.9. Подготовка и использование сфабрикованных доказательств виновности или невиновности."},{"lvl":"3","reason":"4.10 УК","text":"4.10. Действие, направленное на пронос в камеры временного содержания, тюрьму строго режима и иные режимные объекты незаконного имущества. "},{"lvl":"3","reason":"4.11 УК","text":"4.11. Невыполнение требований УДО, действующих в штате."},{"lvl":"2","reason":"4.12 УК","text":"4.12. Невыполнение требований к государственным и частным адвокатам, действующим в штате."},{"lvl":"4","reason":"4.13 УК","text":"4.13. Задержание или арест должностным лицом гражданина без наличия оснований для временного лишения свободы"},{"lvl":"4","reason":"4.14 УК","text":"4.14. Акт преднамеренного неисполнения судебного ордера в указанный срок."},{"lvl":"5","reason":"4.15 УК","text":"4.15. Преднамеренное очевидное превышение должностных полномочий, повлекшие ущемление прав и свобод гражданина."},{"lvl":"5","reason":"4.16 УК","text":"4.16. Неисполнение или ненадлежащее исполнение должностным лицом своих обязанностей."},{"lvl":"4","reason":"4.17 УК","text":"4.17. Предумышленная или непредумышленная передача информации, приводящей к нарушению или помехам в работе госструктуры."},{"lvl":"2","reason":"4.18 Ук","text":"4.18. Беспричинные вызовы экстренных служб, равно как и обман при вызове экстренных служб."},{"lvl":"6","reason":"4.19 УК","text":"4.19. Нанесение или посягательство на вред жизни и здоровью госслужащего."},{"lvl":"6","reason":"4.20 УК","text":"4.20. Дача заведомо ложных показаний и сведений лицу, ведущему следствие или адвокату в ходе рассмотрения дела или проведения допроса."},{"lvl":"3","reason":"4.21 УК","text":"4.21. Обыск человека\/автомобиля\/недвижимости проводимый должностным лицом, без наличия оснований для проведения обыска."},{"lvl":"6","reason":"4.22 УК","text":"4.22. Отказ предоставить документы правоохранителям в ЧС или спецоперации."},{"lvl":"6","reason":"4.23 УК","text":"4.23. Злоупотребление полномочиями должностным лицом, повлекшее нарушение прав граждан."},{"lvl":"3","reason":"4.24 УК","text":"4.24. Умышленное неисполнение законного приказа руководства сотрудниками правопорядка, повлекшее вред правам граждан или организаций."}]},{"name":"Раздел 5. Преступления против национальной безопасности. ","item":[{"lvl":"2","reason":"5.1 УК","text":"5.1. Участие в массовых протестных акциях, проведение которых не было согласовано с администрацией штата."},{"lvl":"3","reason":"5.2 УК","text":"5.2. Инициирование проведения акции, не согласовав их проведение с администрацией штата, равно как и призывы к участию в них."},{"lvl":"4","reason":"5.3 УК","text":"5.3. Участие в массовых протестных акциях, происходящих с применением насилия, равно как с применением оружия."},{"lvl":"5","reason":"5.4 УК","text":"5.4. Инициирование массовых протестных акций, происходящих с применением насилия, равно как с применением оружия"},{"lvl":"4","reason":"5.5 УК","text":"5.5. Участие в преступлениях крупного организованного незаконного формирования."},{"lvl":"6","reason":"5.6 УК","text":"5.6. Создание и управление незаконным формированием для совершения преступлений ради прибыли."},{"lvl":"6","reason":"5.7 УК","text":"5.7. Захват заложника для принуждения государства или граждан к действию или бездействию для освобождения."},{"lvl":"6","reason":"5.8 УК","text":"5.8. Взрыв или поджог для устрашения населения и дестабилизации ситуации."},{"lvl":"6","reason":"5.9 УК","text":"5.9. Крупное преступление или серия мелких преступлений на почве ненависти к группам по различным признакам."},{"lvl":"6","reason":"5.10 УК","text":"5.10. Косвенная помощь террористам и экстремистам через финансирование и обеспечение оружием без участия в преступлении."},{"lvl":"6","reason":"5.11 УК","text":"5.11. Совершение вооруженного нападения на режимные объекты и иные объекты стратегического значения."},{"lvl":"6","reason":"5.12 УК","text":"5.12. Разглашение государственной тайны, угрожающей безопасности США и штата Сюрпрайз и дестабилизирующей их политический строй."},{"lvl":"6","reason":"5.13 УК","text":"5.13. За продажу государственного имущества (патроны, одежда и т.д.) с военных объектов и зданий государственного значения."},{"lvl":"6","reason":"5.14 УК","text":"5.14. За сотрудничество лиц государственных организаций с нелегальной организованной группировкой."}]},{"name":"Раздел 6. Преступления против государственного управления. ","item":[{"lvl":"6","reason":"6.1 УК","text":"6.1. Захват власти в штате с нарушением конституционных норм, обычно с применением силы для изоляции руководителей."},{"lvl":"6","reason":"6.2 УК","text":"6.2. Захват власти в штате с нарушением конституционных норм для изменения государственного строя."},{"lvl":"3","reason":"6.3 УК","text":"6.3. Проникновение, либо посещение служебных помещений государственных организаций без наличия соответствующих полномочий"},{"lvl":"5","reason":"6.4 УК","text":"6.4. Проникновение, либо посещение территории, обладающей статусом режимного объекта без наличия соответствующих полномочий "},{"lvl":"5","reason":"6.5 УК","text":"6.5. Взятка, коммерческий подкуп или незаконное использование должностного положения для получения выгоды."},{"lvl":"4","reason":"6.6 УК","text":"6.6. Подделка документов государственных служащих, подделка экономической документации, подделка приказов и указов гос. служащих."},{"lvl":"6","reason":"6.7 УК","text":"6.7. Присвоение бюджетных средств должностным лицом, равно как и растрата бюджета не в обозначенных при их выделении целях."},{"lvl":"4","reason":"6.8 УК","text":"6.8. Совершение государственными служащими действий, запрещенных в отношении неприкосновенных лиц в период действия неприкосновенности."},{"lvl":"3","reason":"6.9 УК","text":"6.9. Воспрепятствование осуществлению избирательных прав граждан, тайне голосования и работе избирательных комиссий."}]},{"name":"Раздел 7. Преступления, связанные с оборотом оружия. ","item":[{"lvl":"3","reason":"7.1 УК","text":"7.1. Владение, хранение и ношение огнестрельного вооружения без наличия соответствующей лицензии."},{"lvl":"4","reason":"7.2 УК","text":"7.2. Продажа, приобретение, дарение и иные способы распространения и получения огнестрельного вооружения вне специализированных магазинов."},{"lvl":"4","reason":"7.3 УК","text":"7.3. Временная передача личного, а также служебного оружия другому человеку."},{"lvl":"2","reason":"7.4 УК","text":"7.4. Ношение огнестрельного оружия в открытом виде без необходимости."},{"lvl":"4","reason":"7.5 УК","text":"7.5. Хранение, приобретение или продажа конструктивных элементов для улучшения характеристик оружия."},{"lvl":"4","reason":"7.6 УК","text":"7.6. Хранение\/Приобретение\/Продажа конструктивных элементов, являющихся частью заводской комплектации и используемых для сборки оружия."},{"lvl":"4","reason":"7.7 УК","text":"7.7. Владение, хранение, ношение, продажа, приобретение, использование единиц оружия, запрещенных для применения на территории штата."}]}]