[{"item":[{"lvl":"5","reason":"1.1 УК","text":"1.1. За нападение на гражданское лицо, преступнику присваивается 5-ый уровень розыска."},{"lvl":"6","reason":"1.2 УК","text":"1.2. За нападение на государственного служащего преступнику присваивается 6-ый уровень розыска."}],"name":"Глава 1. Не вооруженное нападение."},{"item":[{"lvl":"6","reason":"2.1 УК","text":"2.1 За вооруженное нападение преступнику присваивается 6-ой уровень розыска, а также изымается лицензия на оружие."}],"name":"Глава 2. Вооруженное нападение."},{"item":[{"lvl":"6","reason":"3.1 УК","text":"3.1 За убийство преступнику присваивается 6 уровень розыска, а также изымается лицензия на оружие."}],"name":"Глава 3. Убийство."},{"item":[{"lvl":"3","reason":"4.1 УК","text":"4.1 За любой вид оскорбления государственных служащих при исполнении,нарушителю присваивается 3 уровень розыска."},{"lvl":"3","reason":"4.2 УК","text":"4.2 За неадекватное поведение в сторону государственных служащих при исполнении , нарушителю присваивается 3 уровень розыска"}],"name":"Глава 4. Оскорбление сотрудников государственных служащих"},{"item":[{"lvl":"2","reason":"5.1 УК","text":"5.1 За отказ, нежелание гражданина от предоставления документов,удостоверяющих личность сотруднику правоохранительных органов/военнослу"},{"lvl":"6","reason":"5.2 УК","text":"5.2 За отказ, нежелание гражданина от предоставления документов, удостоверяющих личность сотруднику правоохранительных органов в ситуации"}],"name":"Глава 5. Отказ от предоставления документов."},{"item":[{"lvl":"4","reason":"6.1 УК","text":"6.1 За неподчинение сотруднику правоохранительных органов/военнослужащим МО/сотрудникам ТСР, находящемуся при исполнении, преступнику при"},{"lvl":"6","reason":"6.2 УК","text":"6.2 За неподчинению сотруднику правоохранительных органов/военнослужащим МО/сотрудникам ТСР при  ЧС в штате, а так же при проведении с.о."},{"lvl":"3","reason":"6.3 УК","text":"6.3 За отказ или невозможность оплатить штраф, гражданину присваивается 3 уровень розыска, после чего он задерживается."},{"lvl":"6","reason":"6.4 УК","text":"6.4 За попытку удаления/удаление/порчу любого рода маячков, жучков, браслетов, определяющих местоположение, которымисотрудники ФБР огранич"},{"lvl":"3","reason":"6.5 УК","text":"6.5 Попытка сопротивления аресту - 3 уровень розыска (то есть, попытка убежать от полиции или как-то избежать ареста)"},{"lvl":"3","reason":"6.6 УК","text":"6.6 За попытку сокрытие от сотрудников полиции улик и доказательств - 3 уровень розыска (то есть, если лицо нарушающие уголовный кодекс как-то"}],"name":"Глава 6. Неподчинение."},{"item":[{"lvl":"3","reason":"7.1 УК","text":"7.1 За помеху сотруднику правоохранительных органов/военнослужащим МО/сотрудникам ТСР, находящемуся при исполнении, преступнику присваива"}],"name":"Глава 7. Помеха"},{"item":[{"lvl":"3","reason":"8.1 УК","text":"8.1 За угрозы гражданину штата, нарушителю присваивается 3-ый уровень розыска"},{"lvl":"4","reason":"8.2 УК","text":"8.2 За угрозы государственному служащему при исполнении, нарушителю присваивается 4-ый уровень розыска"},{"lvl":"6","reason":"8.3 УК","text":"8.3 За угрозы руководству государственных организаций, нарушителю присваивается 6-ый уровень розыска"}],"name":"Глава 8. Угрозы"},{"item":[{"lvl":"3","reason":"9.1 УК","text":"9.1 За проникновение на охраняемую правоохранительными органами территорию (Гараж и участок ПД; гараж и офис ФБР), гражданину присваивается "},{"lvl":"2","reason":"9.2 УК","text":"9.2 За проникновение на частную территорию без разрешения владельца, преступнику присваивается 2 уровень розыска."},{"lvl":"6","reason":"9.3 УК","text":"9.3 За проникновение на территорию закрытой военной базы (Территория San Fierro Army, Los Santos Port; территория Тюрьмы Строгого Режима), преступнику при"},{"lvl":"2","reason":"9.4 УК","text":"9.4 За проникновение в патрульные автомобиль без разрешение на это сотрудника полиции - 2 уровень розыска."}],"name":"Глава 9. Проникновение"},{"item":[{"lvl":"2","text":"10.1 За попытку угона государственного или частного транспортного средства, преступнику присваивается 2 уровень розыска.","reason":"10.1 УК"},{"lvl":"4","text":"10.2 За угон транспортного средства, преступнику присваивается 4 уровень розыска.","reason":"10.2 УК"},{"lvl":"4","text":"10.3 Хранения отмычек для угона авто, преступнику присваивается 4 уровня розыска","reason":"10.3 УК"}],"name":"Глава 10. Угон транспортного средства."},{"item":[{"lvl":"3","text":"11.1 За наезд транспортным средством на гражданское лицо, преступнику присваивается 3 уровень розыск, с изъятием лицензии на вождение.","reason":"11.1 УК"},{"lvl":"6","text":"11.2 За наезд транспортным средством на сотрудника правоохранительных органов, преступнику присваивается 6 уровень розыска, с изъятием лице","reason":"11.2 УК"}],"name":"Глава 11. Наезд транспортным средством."},{"item":[{"lvl":"4","text":"12.1 За кражу частного имущества, преступнику присваивается 4 уровень розыска.","reason":"12.1 УК"},{"lvl":"6","text":"12.2 За кражу государственной собственности, собственности гос.организаций, имущества, материалов, преступнику присваивается 6 уровень розы","reason":"12.2 УК"}],"name":"Глава 12. Кража."},{"item":[{"lvl":"4","text":"13.1 За вымогательство денежных средств, частной собственности, преступнику присваивается 4 уровень розыска.","reason":"13.1 УК"},{"lvl":"6","text":"13.2 За вымогательство денежных средств, частной собственности должностным лицом, такому лицу присваивается 6 уровень розыска, увольнение и","reason":"13.2 УК"}],"name":"Глава 13. Вымогательство"},{"item":[{"lvl":"6","text":"14.1 За кражу государственного имущества (патроны, одежда и т.д.) с военных объектов и зданий государственного значения, преступнику присваив","reason":"14.1 УК"}],"name":"Глава 14. Воровство государственного имущества."},{"item":[{"lvl":"6","text":"15.1 За продажу государственного имущества (патроны, одежда и т.д.) с военных объектов и зданий государственного значения, преступнику присва","reason":"15.1 УК"},{"lvl":"6","text":"15.2 За продажу государственного имущества государственным служащим (патроны, одежда и т.д.) с военных объектов и зданий государственного зн","reason":"15.2 УК"}],"name":"Глава 15. Продажа государственного имущества."},{"item":[{"lvl":"6","reason":"16.1 УК","text":"16.1 За производство, изготовление, употребление, приобретение, хранение, перевозку, пересылку или сбыт наркотических веществ, психотропных "}],"name":"Глава 16. Наркотические вещества."},{"item":[{"lvl":"3","reason":"17.1 УК","text":"17.1 За ношение оружия в открытом виде, преступнику присваивается 3 уровень розыска. (Исключение: МЮ/МО/ТСР)"},{"lvl":"6","reason":"17.2 УК","text":"17.2 За ношение оружия без лицензии, преступнику присваивается 6 уровень розыска, а также изымается все оружие, которое у него имеется."},{"lvl":"3","reason":"17.3 УК","text":"17.3 Если при обыске у человека который находится в федеральном розыске находится оружие то ему присваивается 3 уровень розыска, а также изым"},{"lvl":"6","reason":"17.4 УК","text":"17.4 За нелегальную покупку/продажу оружия, преступнику присваивается 6 уровня розыска, а также изымается лицензия на оружие и все оружие, ко"},{"lvl":"3","reason":"17.5 УК","text":"17.5 За производство, изготовление, приобретение, хранение, перевозку, пересылку или сбыт материалов, преступнику присваивается 3 уровень ро"}],"name":"Глава 17. Оружие"},{"item":[{"lvl":"6","text":"18.1 За планирование/исполнение теракта, преступнику присваивается 6 уровень розыска.","reason":"18.1 УК"},{"lvl":"6","text":"18.2 За попытку совершения теракта, преступнику присваивается 6 уровень розыска.","reason":"18.2 УК"},{"lvl":"6","text":"18.3 За пребывание в террористической группировке, преступнику присваивается 6 уровень розыска.","reason":"18.3 УК"},{"lvl":"6","text":"18.4 За вербовку в террористическую группировку, вербующему присваивается 6 уровень розыска.","reason":"18.4 УК"},{"lvl":"6","text":"18.5 За помощь/финансирование/исполнение теракта нарушителю присваивается 6 уровень розыска.","reason":"18.5 УК"}],"name":"Глава 18. Терроризм."},{"item":[{"lvl":"6","text":"19.1 За взятие одного или группы заложников, преступнику присваивается 6 уровень розыска.","reason":"19.1 УК"}],"name":"Глава 19. Взятие в заложники."},{"item":[{"lvl":"6","text":"20.1 За вооруженное насилие, а так же призывы к насилию на митингах, преступнику присваивается 6 уровень розыска.","reason":"20.1 УК"},{"lvl":"2","text":"20.2 За участие в несанкционированном митинге преступнику присваивается 2-й уровень розыска.","reason":"20.2 УК"}],"name":"Глава 20. Митинг."},{"item":[{"lvl":"4","text":"21.1 За призыв к нацизму, нарушителю присваивается 4-ый уровень розыска.","reason":"21.1 УК"},{"lvl":"4","text":"21.2 За проявления нацизма, нарушителю присваивается 4-ый уровень розыска.","reason":"21.2 УК"},{"lvl":"6","text":"21.3 За пребывание в экстремистской группировке преступнику присваивается 6 уровень розыска, а также вживляется маячок, по которому можно уз","reason":"21.3 УК"},{"lvl":"6","text":"21.4 За вербовку в экстремистскую группировку, вербующему присваивается 6 уровень розыска.","reason":"21.4 УК"},{"lvl":"6","text":"21.5 За помощь/финансирование экстремистской группировки нарушителю присваивается 6 уровень розыска.","reason":"21.5 УК"}],"name":"Глава 21. Экстремизм."},{"item":[{"lvl":"3","text":"22.1 За пропаганду установления тоталитарных (национал-социалистического и/или коммунистического) режимов и/или публичное восхваление данн","reason":"22.1 УК"},{"lvl":"6","text":"22.2 За попытку создания/создание национал-социалистической или коммунистической партии, нарушителю присваивается 6-ой уровень розыска","reason":"22.2 УК"},{"lvl":"6","text":"22.3 За вербовку в национал-социалистическую или коммунистическую организацию нарушителю присваивается шестой уровень розыска, нарушителю","reason":"22.3 УК"}],"name":"Глава 22. Пропаганда тоталитарных режимов."},{"item":[{"lvl":"6","text":"23.1 За сотрудничество лиц гос.организаций с нелегальной организованной группировкой, нарушителю присваивается 6 уровень розыска и ЧС орган","reason":"23.1 УК"}],"name":"Глава 23. Сотрудничество лиц гос.организаций с ОПГ."},{"item":[{"lvl":"2","text":"24.1 За занятие проституцией, нарушителю присваивается 2 уровень розыска.","reason":"24.1 УК"},{"lvl":"3","text":"24.2 За вовлечение в занятие проституцией, нарушителю присваивается 3 уровень розыска.","reason":"24.2 УК"}],"name":"Глава 24. Проституция."},{"item":[{"lvl":"6","text":"25.1 Нападение на морское или речное судно в целях завладения чужим имуществом, совершенное с применением насилия либо с угрозой, нарушителю","reason":"25.1 УК"}],"name":"Глава 25. Пиратство."},{"item":[{"lvl":"2","text":"26.1 За осуществление рыболовной деятельности с рыбацкого катера без наличия соответствующей лицензии, дающую на это право, гражданину буде","reason":"26.1 УК"},{"lvl":"2","text":"26.2 За осуществление охоты без наличия соответствующей лицензии, дающей на это право, гражданину будет присвоено 2 уровень розыска после ко","reason":"26.2 УК"}],"name":"Глава 26. Незаконное занятие рыбным / животным добывающим промыслом (браконьерство)."},{"item":[{"lvl":"3","text":"27.1 За дачу или попытку дачи взятки должностному лицу, гражданину присваивается 3 уровень розыска.","reason":"27.1 УК"},{"lvl":"6","text":"27.2 За получение взятки должностным лицом, ему присваивается 6 уровень розыска, увольнение из государственной организации, занесение в Черн","reason":"27.2 УК"},{"lvl":"2","text":"27.3 За давление на сотрудника правоохранительных органов, преступнику присваивается 2 уровень розыска.","reason":"27.3 УК"},{"lvl":"6","text":"27.4 Вымогательство или намек на взятку должностным лицом - 6 уровень розыска.","reason":"27.4 УК"}],"name":"Глава 27. Взятка и давление."},{"item":[{"lvl":"3","text":"28.1 За дачу заведомо ложных показаний сотрудникам правоохранительных органов, нарушителю присваивается 3 уровень розыска.","reason":"28.1 УК"}],"name":"Глава 28. Дача ложных показаний."},{"item":[{"lvl":"6","text":"29.1 За превышение должностных полномочий, должностному лицу присваивается 6 уровень розыска с занесением в Черный Список.","reason":"29.1 УК"}],"name":"Глава 29. Превышение должностных полномочий."},{"item":[{"lvl":"6","text":"30.1 За посягательство на жизнь государственного или общественного деятеля, совершенное в целях прекращения его государственной или иной п","reason":"30.1 УК"},{"lvl":"6","text":"30.2 За действия, направленные на насильственный захват власти или насильственное удержание власти, а равно вооруженный мятеж, в нарушение К","reason":"30.2 УК"},{"lvl":"6","text":"30.3 За разглашение сведений, составляющих государственную тайну, лицом, которому она была доверена или стала известна по службе, работе, есл","reason":"30.3 УК"},{"lvl":"6","text":"30.4 За государственную измену (коллаборационизм, сепаратизм, передача данных о государственной тайне другому государству/штату, шпионаж), п","reason":"30.4 УК"},{"lvl":"6","text":"30.5 За покупку поддельной формы Армии или Копию ключей от военного оборудования/транспорта, преступнику присваивается 6 уровень розыска.30.6","reason":"30.5 УК"}],"name":"Раздел 30. Преступления против основ конституционного строя и безопасности государства."},{"item":[{"lvl":"1","text":"31.1 УК. Нету розыска за это","reason":"Штраф"},{"lvl":"3","text":"31.2 Действие, в ходе которого лицо намеренно даёт ложные показания следствию, с целью загнать в тупик/приостановить следствие.","reason":"31.2 УК"},{"lvl":"3","text":"31.3 Неисполнение приговора суда, решения суда или иного судебного акта.","reason":"31.3 УК"},{"lvl":"6","text":"31.4 Побег из места лишения свободы, из-под ареста или из-под стражи, преступнику присваивается 6 уровень розыска.","reason":"31.4 УК"},{"lvl":"4","text":"31.5 Подкуп или принуждение к даче показаний или уклонению от дачи показаний либо к неправильному переводу","reason":"31.5 УК"},{"lvl":"4","text":"31.6 Незаконные задержание, заключение под стражу или содержание под стражей.","reason":"31.6 УК"},{"lvl":"2","text":"31.7 Привлечение заведомо невиновного к уголовной ответственности или незаконное возбуждение уголовного дела.","reason":"31.7 УК"},{"lvl":"3","text":"31.8 Клевета в отношении судьи, присяжного заседателя, прокурора, лица, производящего дознание.","reason":"31.8 УК"},{"lvl":"2","text":"31.9 Действие, в ходе которого лицо сознательно отказывается от предоставления на суде доказательств по выданному запросу.","reason":"31.9 УК"},{"lvl":"6","text":"31.10 Действия, в ходе которого подсудимый пытается избежать наказание, будь то смена паспорта, либо выезд из штата, карается наложением 6 уро","reason":"31.10 УК"}],"name":"Глава 31. Преступления против судебной системы."},{"item":[{"lvl":"1","text":"32.1 За явку с повинной с 2 - 6 уровнем розыска, преступнику сокращают срок отбывания в местах лишения свободы в 2 раза","reason":"Явка с повинной"}],"name":"Глава 32. Явка с повинной."},{"item":[{"lvl":"3","text":"33.1 Неоднократный ложный вызов сотрудников министерства юстиции через 911 или тревожную кнопку, будет караться выдачей 3-его уровня розыска.","reason":"33.1 УК"},{"lvl":"4","text":"33.2 Неадекватный вызов сотрудников министерства юстиции через 911, будет караться выдачей 4-его уровня розыска.","reason":"33.2 УК"}],"name":"Глава 33. Ложный вызов."},{"item":[{"lvl":"4","text":"34.1 Уход виновником с места ДТП - карается изъятием прав на транспорт, на котором было совершено ДТП, лишением свободы от 4 до 5 лет и выплатой ","reason":"34.1 УК"},{"lvl":"3","text":"34.2 За подстройку ДТП, с целью получения компенсации нарушителю и его сообщникам, присваивается 3 уровень розыска, а так же изымается компен","reason":"34.2 УК"}],"name":"Глава 34. ДТП."},{"item":[{"lvl":"6","text":"35.1 За производство, изготовление, приобретение, хранение, перевозку, пересылку или сбыт дубликата ключа от двери КПП ТСР, преступнику присв","reason":"35.1 УК"}],"name":"Глава 35. Дубликаты ключа от КПП Тюрьмы Строгого Режима."},{"item":[{"lvl":"2","text":"36.1 За подозрение гражданина в преступлении против действующего законодательства, подозреваемому присваивается 2 уровень розыска с послед","reason":"36.1 УК"},{"lvl":"1","text":"36.2 За помощь следствию со 2-3 уровнем розыска, преступнику снимается один уровень розыска.","reason":"Следствие"},{"lvl":"1","text":"36.3 За помощь следствию с 4-6 уровнем розыска, преступнику снимается два уровня розыска.","reason":"Следствие"}],"name":"Глава 36. Следствие"},{"item":[{"lvl":"6","text":"37.1 Совершение взрыва, поджога или иных действий, направленных на разрушение или повреждение узлов связи, авиа и ж/д сообщений, частного иму","reason":"37.1 УК"}],"name":"Глава 37. Диверсия."},{"item":[{"lvl":"4","text":"38.1 За халатное отношение к исполнению своих обязанностей, государственному служащему присваивается 3, 4, 5 или 6 степень розыска.","reason":"38.1 УК"},{"lvl":"6","text":"38.2 Халатное отношение к жизни и здоровью гражданина штата Туксон, которое может причинить или причинило смерть или тяжкий ущерб здоровью с","reason":"38.2 УК"},{"lvl":"3","text":"38.3 Халатное отношение к жизни и здоровью гражданина штата Туксон со стороны гос. служащего, которое может причинить или уже причинило сред","reason":"38.3 УК"},{"lvl":"1","text":"38.4 Халатное отношение к жизни и здоровью гражданина штата Туксон со стороны гос. служащего, которое может причинить или уже причинило лёгк","reason":"38.4 УК"}],"name":"Глава 38. Халатность"},{"item":[{"lvl":"6","text":"39.1 За нарушение мер военного времени штата Туксон, - присваивается 6 уровень розыска","reason":"39.1 УК"}],"name":"Глава 39. Нарушение Мер военного времени"},{"item":[{"lvl":"3","text":"40.1 Лицо, не являющееся государственным служащим или иным сотрудником государственной организации, запрещается выдавать себя за государст","reason":"40.1 УК"}],"name":"Глава 40. Преступления против государственной власти и служебной деятельности"},{"item":[{"lvl":"6","text":"41.1 За нарушения равенства прав и свобод человека и гражданина, закрепленных в Конституции и/или иных нормативно-правовых актах по политиче","reason":"41.1 УК"},{"lvl":"4","text":"41.2 За воспрепятствование проведению массовых акций или участию в них, в случаях когда они проводятся без нарушения закона “О массовых акц","reason":"41.2 УК"}],"name":"Глава 41. Преступления против конституционных прав и свобод человека и гражданина"}]