[{"item":[{"lvl":"3","text":"6.1. Умышленное нанесение телесных повреждений. - 3*","reason":"6.1 УК."},{"lvl":"6","text":"6.2. Убийство. - 6*","reason":"6.2 УК"},{"lvl":"1","text":"6.3. Причинение тяжкого вреда здоровью по неосторожности. - 1*","reason":"6.3 УК Причинение тяжкого вреда здоровью по неосторожности."},{"lvl":"3","text":"6.4. Причинение смерти по неосторожности. - 3*","reason":"6.4 УК. Причинение смерти по неосторожности."},{"lvl":"3","text":"6.5. Угроза расправой (прямая или косвенная) - 3*","reason":"6.5 УК. Угроза расправой (прямая или косвенная) гражданскому, а равно их близким."},{"lvl":"5","text":"6.6. Умышленное причинение тяжкого вреда здоровью. - 5*","reason":"6.6 УК. Умышленное причинение тяжкого вреда здоровью."},{"lvl":"2","text":"6.7. Заведомое оставление без помощи лица, находящегося в опасном состоянии - 2*","reason":"6.7 УК. Оставление в опасности. Заведомое оставление без помощи лица, находящегося в опасном для жизни или здоровья состоянии."}],"name":"Глава 6. Преступления против жизни и здоровья"},{"item":[{"lvl":"6","text":"7.1**. Похищение человека.Приоритет розыска 6.","reason":"7.1 УК. Похищение человека "},{"lvl":"4","text":"7.2. Клевета, содержащаяся в публичном выступлении, средствах массовой информации либо с использованием своего служебного положения.","reason":"7.2 УК. Клевета, содержащаяся в публичном выступлении, средствах массовой информации либо с использованием своего служебного положения."},{"lvl":"2","text":"7.3. Клевета, соединенная с обвинением лица в совершении преступления.","reason":"7.3 УК. Клевета, соединенная с обвинением лица в совершении преступления."},{"lvl":"4","text":"7.4. Нарушение против личности, деловой репутации и оскорбления сотрудниками представительства Средств Массовой информации","reason":"7.4 УК. Нарушение против личности, деловой репутации и оскорбления сотрудниками представительства Средств Массовой информации."}],"name":"Глава 7. Преступления против свободы, чести и достоинства личности"},{"item":[{"lvl":"3","text":"8.1. Насильственные действия сексуального характера. Приоритет розыска 3.","reason":"8.1 УК. Насильственные действия сексуального характера."},{"lvl":"5","text":"8.2. Насильственные действия сексуального характера повлекшее по неосторожности причинение тяжкого вреда здоровью или смерть потерпевшег","reason":"8.2 УК. Насильственные действия сексуального характера повлекшее по неосторожности причинение тяжкого вреда здоровью или смерть потерпевш"},{"lvl":"2","text":"8.3*. Насильственное принуждение лица к половому сношению или совершению иных действий сексуального характера путем шантажа","reason":"8.3 УК. Насильственное принуждение лица к половому сношению или совершению иных действий сексуального характера путем шантажа"},{"lvl":"3","text":"8.4*. Действия направленные на организацию проституции другими лицами, а равно создание или содержание мест для занятие проституции.","reason":"8.4 УК. Действия направленные на организацию проституции другими лицами, а равно создание или содержание мест для занятие проституции."}],"name":"Глава 8. Преступления против половой неприкосновенности и половой свободы личности"},{"item":[{"lvl":"1","text":"9.1. Незаконное собирание или распространение сведений о частной жизни лица, составляющих его личную или семейную тайну","reason":"9.1 УК. Незаконное собирание или распространение сведений о частной жизни лица, составляющих его личную или семейную тайну"},{"lvl":"6","text":"9.2**. Воспрепятствование свободному осуществлению гражданином своих избирательных прав, в том числе соединенные с подкупом, обманом.","reason":"9.2 УК. Воспрепятствование свободному осуществлению гражданином своих избирательных прав, в том числе соединенные с подкупом, обманом, прин"},{"lvl":"1","text":"9.3. Воспрепятствование законной профессиональной деятельности журналистов путем принуждения их к распространению либо к отказу.","reason":"9.3 УК. Воспрепятствование законной профессиональной деятельности журналистов путем принуждения их к распространению либо к отказу от р"},{"lvl":"1","text":"9.4. Воспрепятствование законной профессиональной деятельности журналистов путем незаконного ограничения права распространения ","reason":"9.4 УК. Воспрепятствование законной профессиональной деятельности журналистов путем незаконного ограничения права распространения."},{"lvl":"2","text":"9.5 Незаконное проникновение в жилище и частную территорию, совершенное против воли владельца","reason":"9.5 УК. Незаконное проникновение в жилище и частную территорию, совершенное против воли владельца"}],"name":"Глава 9. Преступления против конституционных прав и свобод человека и гражданина"},{"item":[{"lvl":"2","text":"10.1 Кража, то есть тайное хищение чужого имущества.","reason":"10.1 УК. Кража, то есть тайное хищение чужого имущества."},{"lvl":"2","text":"10.2 Мошенничество, то есть хищение чужого имущества или приобретение права на чужое имущество путем обмана или злоупотребления доверие.","reason":"10.2 УК. Мошенничество, то есть хищение чужого имущества или приобретение права на чужое имущество путем обмана или злоупотребления доверие"},{"lvl":"3","text":"10.3 Грабеж, то есть открытое хищение чужого имущества.","reason":"10.3 УК. Грабеж, то есть открытое хищение чужого имущества."},{"lvl":"5","text":"10.4 Разбой, то есть нападение в целях хищения чужого имущества, совершенное с применением насилия, опасного для жизни или здоровья.","reason":"10.4 УК. Разбой, то есть нападение в целях хищения чужого имущества, совершенное с применением насилия, опасного для жизни или здоровья."},{"lvl":"3","text":"10.5. Неправомерное завладение автомобилем или иным транспортным средством без цели хищения (угон).","reason":"10.5 УК. Неправомерное завладение автомобилем или иным транспортным средством без цели хищения (угон)."},{"lvl":"3","text":"10.6 Умышленные уничтожение чужого имущества.","reason":"10.6 УК. Умышленные уничтожение чужого имущества."},{"lvl":"4","text":"10.7 Умышленные уничтожение или повреждение чужого имущества, совершенные из хулиганских побуждений, путем поджога, взрыва.","reason":"10.7 УК. Умышленные уничтожение или повреждение чужого имущества, совершенные из хулиганских побуждений, путем поджога, взрыва."}],"name":"Глава 10. Преступления против собственности"},{"item":[{"lvl":"1","text":"11.1. Осуществление предпринимательской деятельности без регистрации.","reason":"11.1 УК. Осуществление предпринимательской деятельности без регистрации."},{"lvl":"3","text":"11.2 Принуждение к совершению сделки или к отказу от ее совершения под угрозой применения насилия, уничтожения или повреждения.","reason":"11.2 УК. "},{"lvl":"1","text":"11.3 Организация, проведение и участие в азартных играх в общественных местах.","reason":"11.3 УК.Организация, проведение и участие в азартных играх в общественных местах."},{"lvl":"3","text":"11.4 Уклонение от уплаты налогов.Наказывается принудительным взысканием суммы долга в 2-х.","reason":"11.4 УК. Уклонение от уплаты налогов.Наказывается принудительным взысканием суммы долга в 2-х."},{"lvl":"3","text":"11.5 Сокрытие денежных средств либо имущества, за счет которых должно производиться взыскание налогов.","reason":"11.5 УК. Сокрытие денежных средств либо имущества, за счет которых должно производиться взыскание налогов."},{"lvl":"4","text":"11.6 Ограничение конкуренции путем заключения соглашения между субъектами-конкурентами с ущербом.","reason":"11.6 УК.Ограничение конкуренции путем заключения соглашения между субъектами-конкурентами с ущербом."},{"lvl":"5","text":"11.7 Несогласованная сдача государственного имущества в аренду, в целях извлечения дохода в крупном размере.","reason":"11.7 УК. Несогласованная сдача государственного имущества в аренду, в целях извлечения дохода в крупном размере."},{"lvl":"2","text":"11.8 Незаконная добыча (вылов) или транспортировка водных биоресурсов в крупном размере.","reason":"11.8 УК. Незаконная добыча (вылов) или транспортировка водных биоресурсов в крупном размере"}],"name":"Глава 11. Преступления в сфере экономической деятельности"},{"item":[{"lvl":"6","text":"12.1 Терроризм.","reason":"12.1 УК. Терроризм."},{"lvl":"6","text":"12.2 Склонение, вербовка или иное вовлечение лица в терроризм, а равно финансирование терроризма.","reason":"12.2 УК. Склонение, вербовка или иное вовлечение лица в терроризм, а равно финансирование терроризма."},{"lvl":"6","text":"12.3 Захват или удержание лица в качестве заложника, совершенные в целях понуждения государства.","reason":"12.3 УК. Захват или удержание лица в качестве заложника, совершенные в целях понуждения государства."},{"lvl":"3","text":"12.4 Заведомо ложное сообщение о готовящихся взрыве, поджоге или иных действиях, создающих опасность гибели людей","reason":"12.4 УК. Заведомо ложное сообщение о готовящихся взрыве, поджоге или иных действиях, создающих опасность гибели людей."},{"lvl":"4","text":"12.5 Организация массовых беспорядков, а равно участие в них, сопровождавшихся насилием, погромами, поджогами, уничтожением имущества и т.д","reason":"12.5 УК. Организация массовых беспорядков, а равно участие в них, сопровождавшихся насилием, погромами, поджогами, уничтожением имущества и т"},{"lvl":"2","text":"12.6 Хулиганство, то есть грубое нарушение общественного порядка, выражающее явное неуважение к обществу.","reason":"12.6 УК. Хулиганство, то есть грубое нарушение общественного порядка, выражающее явное неуважение к обществу."},{"lvl":"2","text":"12.7 Незаконное проникновение на закрытую территорию.","reason":"12.7 УК. Незаконное проникновение на закрытую территорию."},{"lvl":"6","text":"12.7.1 Незаконное проникновение на закрытую территорию обьектов Министерства Обороны.","reason":"12.7.1 УК. Незаконное проникновение на закрытую территорию обьектов Министерства Обороны."},{"lvl":"3","text":"12.8 Незаконные приобретение, передача, сбыт, хранение и т.д запрещённых припасов и средств самообороны ","reason":"12.8 УК. Незаконные приобретение, передача, сбыт, хранение и т.д запрещенных припасов и средств самообороны "},{"lvl":"4","text":"12.9 Незаконные приобретение, передача, сбыт, хранение и т.д взрывчатых веществ ","reason":"12.9 УК. Незаконные приобретение, передача, сбыт, хранение и т.д взрывчатых веществ "},{"lvl":"4","text":"12.10 Хищение огнестрельного оружия, комплектующих деталей к нему, спецсредств, боеприпасов, взрывчатых веществ.","reason":"12.10 УК. Хищение огнестрельного оружия, комплектующих деталей к нему, спецсредств, боеприпасов, взрывчатых веществ."},{"lvl":"4","text":"12.10.1 Хищение, совершенное сотрудниками правоохранительных органов, огнестрельного оружия и д. запрещенных средств","reason":"12.10.1 УК. Хищение, совершенное сотрудниками правоохранительных органов, огнестрельного оружия и д. запрещеных средств"},{"lvl":"1","text":"12.11 Нарушение установленного порядка организации либо проведения собрания, митинга, демонстрации, шествия или пикетирования.","reason":"12.11 УК. Нарушение установленного порядка организации либо проведения собрания, митинга, демонстрации, шествия или пикетирования."},{"lvl":"2","text":"12.12 Нахождение гражданина в элементах скрывающих личность лицами (( Системная маска )), не имеющих на это право.","reason":"12.12 УК. Нахождение гражданина в элементах скрывающих личность лицами (( Системная маска )), не имеющих на это право."},{"lvl":"3","text":"12.13 Незаконные приобретение, передача, сбыт, хранение, перевозка, ношение или использование любых отмычек. (( для автоугона, ТСР ))","reason":"12.13 УК. Незаконные приобретение, передача, сбыт, хранение, перевозка, ношение или использование любых отмычек. (( для автоугона, ТСР ))"}],"name":"Глава 12. Преступления против общественной безопасности"},{"item":[{"lvl":"1","text":"13.1 Незаконное приобретение, продажа, хранение, перевозка, изготовление, сбор наркотических веществ и семян свыше 2 грамм.","reason":"13.1 УК. Незаконное приобретение, продажа, хранение, перевозка, изготовление, сбор наркотических веществ и семян свыше 2 грамм."},{"lvl":"4","text":"13.2 Незаконные приобретение, продажа, хранение, перевозка, изготовление, сбор наркотических средств и семян свыше 50 грамм.","reason":"13.2 УК. Незаконные приобретение, продажа, хранение, перевозка, изготовление, сбор наркотических средств и семян свыше 50 грамм."}],"name":"Глава 13. Преступления против здоровья населения и общественной нравственности"},{"item":[{"lvl":"6","text":"14.1 Посягательство на жизнь государственного или общественного деятеля, совершенное в целях прекращения его государственной деятельности","reason":"14.1 УК. Посягательство на жизнь государственного или общественного деятеля, совершенное в целях прекращения его государственной деятельно"},{"lvl":"6","text":"14.2 Действия, направленные на насильственный захват власти или насильственное удержание власти, а равно вооруженный мятеж.","reason":"14.2 УК. Действия, направленные на насильственный захват власти или насильственное удержание власти, а равно вооруженный мятеж."},{"lvl":"6","text":"14.3 Разглашение сведений, составляющих государственную тайну, лицом, которому она была доверена или стала известна по службе, работе.","reason":"14.3 УК. Разглашение сведений, составляющих государственную тайну, лицом, которому она была доверена или стала известна по службе, работе."},{"lvl":"6","text":"14.4 Действия направленные на подрыв национальной безопасности и государственного устройства, выраженное в безосновательном.","reason":"14.4 УК. Действия направленные на подрыв национальной безопасности и государственного устройства, выраженное в безосновательном."}],"name":"Глава 14. Преступления против основ конституционного строя и безопасности государства"},{"item":[{"lvl":"4","text":"15.1 Превышение должностных полномочий, то есть совершение должностным лицом действий нарушающие закон","reason":"15.1 УК. Превышение должностных полномочий, то есть совершение должностным лицом действий нарушающие закон."},{"lvl":"3","text":"15.1.1 Злоупотребление должностными полномочиями, то есть использование должностным лицом своих полномочий вопреки интересам службы.","reason":"15.1.1 УК. Злоупотребление должностными полномочиями, то есть использование должностным лицом своих полномочий вопреки интересам службы."},{"lvl":"2","text":"15.2 Умышленное неисполнение сотрудником органов правопорядка приказа начальника.","reason":"15.2 УК. Умышленное неисполнение сотрудником органов правопорядка приказа начальника."},{"lvl":"2","text":"15.3 Самовольное присвоение гражданином полномочий должностного лица, повлекшие существенное нарушение прав и законных интересов граждан.","reason":"15.3 УК Самовольное присвоение гражданином полномочий должностного лица, повлекшие существенное нарушение прав и законных интересов гражд."},{"lvl":"5","text":"15.4 Получение взятки, то есть получение должностным лицом, лично или через посредника взятки в виде денег, иного имущества и услуг.","reason":"15.4 УК. Получение взятки, то есть получение должностным лицом, лично или через посредника взятки в виде денег, иного имущества и услуг."},{"lvl":"3","text":"15.5 Дача взятки должностному лицу, лично или через посредника.","reason":"15.5 УК. Дача взятки должностному лицу, лично или через посредника."},{"lvl":"4","text":"15.6 Халатность, то есть неисполнение или ненадлежащее исполнение должностным лицом своих обязанностей вследствие недобросовестной службы","reason":"15.6 УК. Халатность, то есть неисполнение, ненадлежащее исполнение должностным лицом своих обязанностей вследствие недобросовестной службы"}],"name":"Глава 15. Преступления против власти"},{"item":[{"lvl":"6","text":"16.1 Вмешательство в какой бы то ни было форме в деятельность суда, следствия, ограничение прав граждан.","reason":"16.1 УК. Вмешательство в какой бы то ни было форме в деятельность суда, следствия, ограничение прав граждан."},{"lvl":"3","text":"16.1.1 Воспрепятствование законной профессиональной деятельности адвоката по защите доверителя от уголовного преследования.","reason":"16.1.1 УК. Воспрепятствование законной профессиональной деятельности адвоката по защите доверителя от уголовного преследования."},{"lvl":"4","text":"16.1.2 Воспрепятствование законной профессиональной деятельности прокурора или иного лица, производящего следствие.","reason":"16.1.2 УК. Воспрепятствование законной профессиональной деятельности прокурора или иного лица,производящего следствие."},{"lvl":"6","text":"16.2 Угроза, а равно посягательство на жизнь судьи и других участников следствия","reason":"16.2 УК. Угроза, а равно посягательство на жизнь судьи и других"},{"lvl":"1","text":"16.3 Неуважение к суду, в том числе оскорбление участников судебного разбирательства.","reason":"16.3 УК. Неуважение к суду, в том числе оскорбление участников судебного разбирательства."},{"lvl":"2","text":"16.4 Привлечение заведомо невиновного к уголовной или административной ответственности.","reason":"16.4 УК. Привлечение заведомо невиновного к уголовной или административной ответственности."},{"lvl":"3","text":"16.5 Заведомо незаконное задержание, заключение под стражу или содержание под стражей.","reason":"16.5 УК. Заведомо незаконное задержание, заключение под стражу или содержание под стражей."},{"lvl":"1","text":"16.6 Фальсификация доказательств по гражданскому, административному делу лицом, участвующим в деле, или его представителем.","reason":"16.6 УК. Фальсификация доказательств по гражданскому, административному делу лицом, участвующим в деле, или его представителем."},{"lvl":"5","text":"16.7 Фальсификация доказательств по уголовному делу лицом, производящим расследование, прокурором или защитником.","reason":"16.7 УК. Фальсификация доказательств по уголовному делу лицом, производящим расследование, прокурором или защитником."},{"lvl":"5","text":"16.8 Вынесение судьей (судьями) заведомо неправомерного приговора, решения или иного судебного акта.","reason":"16.8 УК. Вынесение судьей (судьями) заведомо неправомерного приговора, решения или иного судебного акта."},{"lvl":"1","text":"16.9 Заведомо ложный донос о совершении преступления.","reason":"16.9 УК. Заведомо ложный донос о совершении преступления."},{"lvl":"1","text":"16.10 Заведомо ложные показания свидетеля, потерпевшего либо заключение или показание эксперта, показание специалиста в суде.","reason":"16.10 УК. Заведомо ложные показания свидетеля, потерпевшего либо заключение или показание эксперта, показание специалиста в суде."},{"lvl":"3","text":"16.11 Подкуп свидетеля, потерпевшего в целях дачи ими ложных показаний либо эксперта, специалиста в целях дачи ими ложного заключения или лож","reason":"16.11 УК. Подкуп свидетеля, потерпевшего в дачи ими ложных показаний либо эксперта, специалиста в целях дачи ими ложного заключения или "},{"lvl":"4","text":"16.12 Злостное неисполнение вступивших в законную силу приговора суда, решения суда, иного судебного акта, постановления прокурора,ордера.","reason":"16.12 УК. Злостное неисполнение вступивших в законную силу приговора суда, решения суда, иного судебного акта, постановления прокурора,ордер."},{"lvl":"2","text":"16.13 Сокрытие улик или уничтожение улик.","reason":"16.13 УК. Сокрытие улик или уничтожение улик."},{"lvl":"3","text":"16.14 Уклонение от расследования, задержания и суда, намеренные действия, которые направлены правонарушителем уклонение от реального срока","reason":"16.14 УК. Уклонение от расследования, задержания и суда, намеренные действия, которые направлены правонарушителем на уклонение от реального "}],"name":"Глава 16. Преступления против правосудия"},{"item":[{"lvl":"6","text":"17.1 Посягательство на жизнь сотрудника правоохранительного органа, военнослужащего","reason":"17.1 УК. Посягательство на жизнь сотрудника правоохранительного органа, военнослужащего"},{"lvl":"1","reason":"17.2 УК. Применение насилия, не опасного для жизни или здоровья, либо угроза применения насилия","text":"17.2 Применение насилия, не опасного для жизни или здоровья, либо угроза применения насилия"},{"lvl":"3","reason":"17.3 УК. Использование не зарегистрированной лицензии и(или) подделка удостоверения или иного официального документа.","text":"17.3 Использование не зарегистрированной лицензии и(или) подделка удостоверения или иного официального документа."},{"lvl":"2","reason":"17.4 УК. Самоуправство, то есть самовольное, вопреки установленному законам.","text":"17.4 Самоуправство, то есть самовольное, вопреки установленному законам."},{"lvl":"3","reason":"17.5 Неповиновение законному требованию, распоряжению правомочного лица.","text":"17.5 Неповиновение законному требованию, распоряжению правомочного лица."},{"lvl":"2","reason":"17.6 УК Отказ от оплаты штрафа выписанного правомочным лицом.","text":"17.6 Отказ от оплаты штрафа выписанного правомочным лицом."},{"lvl":"2","reason":"17.7 УК. Укрывательство преступника и (или) соучастника, орудий и средств совершения преступления и д.","text":"17.7 Укрывательство преступника и (или) соучастника, орудий и средств совершения преступления и д."}],"name":"Глава 17. Преступления против порядка управления"},{"item":[{"lvl":"4","reason":"18.1 УК. Распространение секретной информации с секретностью [CONFIDENTIAL].","text":"18.1 Распространение секретной информации с секретностью [CONFIDENTIAL]."},{"lvl":"5","reason":"18.1.1 УК. Распространение секретной информации с секретностью [SECRET].","text":"18.1.1 Распространение секретной информации с секретностью [SECRET]."},{"lvl":"6","reason":"18.1.2 УК. Распространение секретной информации с секретностью [TOP SECRET].","text":"18.1.2 Распространение секретной информации с секретностью [TOP SECRET]."}],"name":"Глава 18. Распространение секретной информации"},{"item":[{"lvl":"2","reason":"19.1 УК. Агитация за день до выборов и во время выборов.","text":"19.1 Агитация за день до выборов и во время выборов."},{"lvl":"3","reason":"19.2 УК. Редактирование сотрудником агитационных объявлений за день до выборов и во время выборов.","text":"19.2 Редактирование сотрудником агитационных объявлений за день до выборов и во время выборов."},{"lvl":"6","reason":"19.3 УК. Накрутка голосов путем махинаций в избирательной гонке.","text":"19.3 Накрутка голосов путем махинаций в избирательной гонке."},{"lvl":"6","reason":"19.4 УК. Проведение агитационной кампании на охраняемой территории.","text":"19.4 Проведение агитационной кампании на охраняемой территории."},{"lvl":"4","reason":"19.5 УК. Дача денег/подарка за избирательный голос в гонке кандидатов.","text":"19.5 Дача денег/подарка за избирательный голос в гонке кандидатов."},{"lvl":"4","reason":"19.6 УК. Взятие денег/подарка за избирательный голос в гонке кандидатов.","text":"19.6 Взятие денег/подарка за избирательный голос в гонке кандидатов."},{"lvl":"5","reason":"19.7 УК. Шантажирование кандидата предвыборной гонки, чтобы тот отступил от кандидатуры.","text":"19.7 Шантажирование кандидата предвыборной гонки, чтобы тот отступил от кандидатуры."}],"name":"Глава 19. Нарушение предвыборной гонки"},{"item":[{"lvl":"3","reason":"20.1 УК. Дезертирство, то есть самовольное оставление части или места службы в целях уклонения от прохождения военной службы.","text":"20.1 Дезертирство, то есть самовольное оставление части или места службы в целях уклонения от прохождения военной службы."},{"lvl":"3","reason":"20.2 УК. Умышленные уничтожение или повреждение оружия, боеприпасов или предметов военной техники.","text":"20.2 Умышленные уничтожение или повреждение оружия, боеприпасов или предметов военной техники."},{"lvl":"3","reason":"20.3 УК. Уничтожение или повреждение по неосторожности оружия, боеприпасов или предметов военной техники, повлекшие тяжкие последствия.","text":"20.3 Уничтожение или повреждение по неосторожности оружия, боеприпасов или предметов военной техники, повлекшие тяжкие последствия."},{"lvl":"2","reason":"20.4 УК. Нарушение правил вождения или эксплуатации боевой, специальной или транспортной машины.","text":"20.4 Нарушение правил вождения или эксплуатации боевой, специальной или транспортной машины."},{"lvl":"3","reason":"20.5 УК. Нарушение правил полетов или подготовки к ним либо иных правил эксплуатации военных летательных аппаратов.","text":"20.5 Нарушение правил полетов или подготовки к ним либо иных правил эксплуатации военных летательных аппаратов."}],"name":"Глава 20. Преступления против военной службы"}]